{
    "Missing Safe Method": {
        "description": "Description\n\nIntroduction\n\nCandidate methods for the Missing Safe Method smell are methods whose names\nend with an exclamation mark.\n\nAn exclamation mark in method names means (the explanation below is taken from\nhere):\n\nThe ! in method names that end with ! means, “This method is dangerous”—or,\nmore precisely, this method is the “dangerous” version of an otherwise\nequivalent method, with the same name minus the !. “Danger” is relative; the\n! doesn’t mean anything at all unless the method name it’s in corresponds to\na similar but bang-less method name.\nSo, for example, gsub! is the dangerous version of gsub. exit! is the\ndangerous version of exit. flatten! is the dangerous version of flatten. And\nso forth.\n\nSuch a method is called Missing Safe Method if and only if the non-bang\nversion does not exist and this method is reported as a smell.\n\nMissing Safe Method was formerly known as Prima Donna Method.\n\nExample\n\nGiven\n\nruby\nclass C\n  def foo; end\n  def foo!; end\n  def bar!; end\nend\n\nReek would report the Missing Safe Method smell for bar!, but not for foo!.\n\nReek reports this smell only in a class context, not in a module context in order to allow perfectly legit code like this:\n\n```ruby\nclass Parent\n  def foo; end\nend\n\nmodule Dangerous\n  def foo!; end\nend\n\nclass Son < Parent\n  include Dangerous\nend\n\nclass Daughter < Parent\nend\n```\n\nIn this example, Reek would not report the Missing Safe Method smell for the\nmethod foo of the Dangerous module.",
        "option": "Missing Safe Method offers the Basic Smell Options.\n\nImagine code like this:\n\nruby\nclass Alfa\n  def bravo!\n  end\nend\n\nThis would report:\n\nruby.rb -- 1 warning:\n  [1]:MissingSafeMethod: Alfa has missing safe method 'bravo!'\n\nIf you want to suppress this warning you can do this via source comment like this:\n\n```ruby\n\n:reek:MissingSafeMethod { exclude: [ bravo! ] }\n\nclass Alfa\n  def bravo!\n  end\nend\n```"
    }
}