{
    "Uncommunicative Variable Name": {
        "description": "Description\n\nIntroduction\n\nAn Uncommunicative Variable Name is a variable name that doesn't communicate\nits intent well enough. This code smell is a case of\nUncommunicative Name.\n\nCurrent Support in Reek\n\nUncommunicative Variable Name checks for:\n\nsingle-character names\nany name ending with a number\ncamelCaseVariableNames",
        "option": "Reek's Uncommunicative Variable Name detector supports the\nBasic Smell Options, plus:\n\n| Option         | Value       | Effect  |\n| ---------------|-------------|---------|\n| reject | array of strings | The set of names that Reek uses to check for bad names. Defaults to single-letter names, names ending with a number or names containing upper case letters. |\n| accept | array of strings | Names that will be accepted (not reported) even if they match one of the reject expressions. Defaults to _.|\n\nAn example configuration could look like this:\n\n```yaml\n\nUncommunicativeVariableName:\n  accept:\n    - x\n    - var1\n  reject:\n    - helper\n    - foobar\n```\n\nReek will convert whatever you give it as a string to the corresponding regex, so \"foobar\" from above will be converted to /foobar/ internally.\n\nApplying a configuration to a source file like this:\n\nruby\ndef omg\n  x = 5 # Should not be reported\n  var1 = true # Should not be reported\n  helper = 42 # Should be reported\n  foobar = false # Should be reported\nend\n\nReek would report:\n\nsmelly.rb -- 2 warnings:\n  [5]:UncommunicativeVariableName: omg has the variable name 'foobar' [https://github.com/troessner/reek/blob/master/docs/Uncommunicative-Variable-Name.md]\n  [4]:UncommunicativeVariableName: omg has the variable name 'helper' [https://github.com/troessner/reek/blob/master/docs/Uncommunicative-Variable-Name.md]\n\nSometimes just strings are not enough for configuration. E.g. consider this code sample:\n\nruby\ndef omg\n  foo = 42\n  foobar = 4242\nend\n\nand now imagine that you want to reject the name \"foo\" but not \"foobar\". This wouldn't be possible with just using strings.\nFor this reason Reek has a special syntax that allows you to use regexes by using a forward slash at the beginning and the end of the string.\nEverything within the forward slashes will be loaded as a regex.\n\nA possible configuration that allows \"foobar\" but rejects \"foo\" could look like this:\n\n```yaml\n\nUncommunicativeVariableName:\n  reject:\n    - \"/^foo$/\"\n```\n\nReek 4\n\nIn Reek 4 you could also pass regexes to accept or reject, meaning this was perfectly valid as well:\n\nyaml\nUncommunicativeVariableName:\n  accept:\n    - !ruby/regexp /write/\n\nSupport for this has been scrapped with Reek 5 to make the Reek configuration more yaml standard compliant.\nYou can still pass in regexes, you just have to wrap them into a string. Please see \"Advanced configuration\" above."
    }
}