{
    "Unused Private Method": {
        "description": "Description\n\nIntroduction\n\nClasses should use their private methods. Otherwise this is dead\ncode which is confusing and bad for maintenance.\n\nThe Unused Private Method detector reports unused private instance\nmethods and instance methods only - class methods are ignored.\n\nExample\n\nGiven:\n\nruby\nclass Car\n  private\n  def drive; end\n  def start; end\nend\n\nReek would emit the following warning:\n\n2 warnings:\n  [3]:Car has the unused private instance method `drive` (UnusedPrivateMethod)\n  [4]:Car has the unused private instance method `start` (UnusedPrivateMethod)",
        "option": "Unused Private Method offers the Basic Smell Options.\n\nPrivate methods that are called via dynamic dispatch\nwill trigger a false alarm since detecting something like this is far out of\nscope for Reek. In this case you can disable this detector via the exclude\nconfiguration option (which is part of the Basic Smell Options)\nfor instance like this (an example from Reek's own codebase):\n\n```ruby\n\n:reek:UnusedPrivateMethod { exclude: [ process_ ] }\n\nclass ContextBuilder\n  def process_begin\n    # ....\n  end\nend\n```\n\nNote that disabling this detector via comment works on a class scope, not\na method scope (like you can see above).\n\nAnother simple example would be:\n\nruby\nclass Alfa\n  private\n  def bravo\n  end\nend\n\nThis would report:\n\nruby.rb -- 1 warning:\n  [3]:UnusedPrivateMethod: Alfa has the unused private instance method 'bravo'\n\nIf you want to suppress this warning you can do this via source comment like this:\n\n```ruby\n\n:reek:UnusedPrivateMethod: { exclude: bravo }\n\nclass Alfa\n  private\n  def bravo\n  end\nend\n```\n\nKnown limitations\n\nMethod calls via dynamic dispatch (e.g. via send) is something Reek (or any other\n  static tool for that matter) cannot detect.\nMethod calls via callback like Rails filters\n  will trigger this as well, e.g.:\n\n```ruby\n  class BankController < ActionController::Base\n    before_action :audit\n\nprivate\ndef audit\n  # ....\nend\n\nend\n```\n* Reek works on a per-file base. This means that using something like the template pattern\n  with private methods will trigger this detector.\n  We do believe though that using private methods to fill out a template in a\n  superclass is not a good idea in general so this probably isn't really a problem\n  but still worth mentioning it."
    }
}