{
    "name": "varFuncNullUB",
    "meta": {
        "severity": "portability",
        "cwe": "475",
        "url": "https://cwe.mitre.org/data/definitions/475.html"
    },
    "content": {
        "introduction": "Passing NULL after the last typed argument to a variadic function leads to undefined behaviour.\\012The C99 standard, in section 7.15.1.1, states that if the type used by va_arg() is not compatible with the type of the actual next argument (as promoted according to the default argument promotions), the behavior is undefined.\\012The value of the NULL macro is an implementation-defined null pointer constant (7.17), which can be any integer constant expression with the value 0, or such an expression casted to (void*) (6.3.2.3). This includes values like 0, 0L, or even 0LL.\\012In practice on common architectures, this will cause real crashes if sizeof(int) != sizeof(void*), and NULL is defined to 0 or any other null pointer constant that promotes to int.\\012To reproduce you might be able to use this little code example on 64bit platforms. If the output includes \"ERROR\", the sentinel had only 4 out of 8 bytes initialized to zero and was not detected as the final argument to stop argument processing via va_arg(). Changing the 0 to (void*)0 or 0L will make the \"ERROR\" output go away.\\012#include <stdarg.h>\\012#include <stdio.h>\\012\\012void f(char *s, ...) {\\012    va_list ap;\\012    va_start(ap,s);\\012    for (;;) {\\012        char *p = va_arg(ap,char*);\\012        printf(\"%018p, %s\\n\", p, (long)p & 255 ? p : \"\");\\012        if(!p) break;\\012    }\\012    va_end(ap);\\012}\\012\\012void g() {\\012    char *s2 = \"x\";\\012    char *s3 = \"ERROR\";\\012\\012    // changing 0 to 0L for the 7th argument (which is intended to act as sentinel) makes the error go away on x86_64\\012    f(\"first\", s2, s2, s2, s2, s2, 0, s3, (char*)0);\\012}\\012\\012void h() {\\012    int i;\\012    volatile unsigned char a[1000];\\012    for (i = 0; i<sizeof(a); i++)\\012        a[i] = -1;\\012}\\012\\012int main() {\\012    h();\\012    g();\\012    return 0;\\012}",
        "attributes": {
            "severity": "portability",
            "cwe_id": "475",
            "inconclusive": false
        }
    }
}