{
  "name": "bugprone-exception-escape",
  "meta": {
    "url": "https://clang.llvm.org/extra/clang-tidy/checks/bugprone/exception-escape.html",
    "fixable": false
  },
  "content": {
    "introduction": "Finds functions which may throw an exception directly or indirectly, but they\nshould not. The functions which should not throw exceptions are the following:\n\nDestructors\n\n\nMove constructors\n\n\nMove assignment operators\n\n\nThe \nmain()\n functions\n\n\nswap()\n functions\n\n\niter_swap()\n functions\n\n\niter_move()\n functions\n\n\nFunctions marked with \nthrow()\n or \nnoexcept\n\n\nOther functions given as option\n\nA destructor throwing an exception may result in undefined behavior, resource\nleaks or unexpected termination of the program. Throwing move constructor or\nmove assignment also may result in undefined behavior or resource leak. The\n\nswap()\n operations expected to be non throwing most of the cases and they\nare always possible to implement in a non throwing way. Non throwing \nswap()\n\noperations are also used to create move operations. A throwing \nmain()\n\nfunction also results in unexpected termination.\n\nFunctions declared explicitly with \nnoexcept(false)\n or \nthrow(exception)\n\nwill be excluded from the analysis, as even though it is not recommended for\nfunctions like \nswap()\n, \nmain()\n, move constructors, move assignment\noperators and destructors, it is a clear indication of the developer’s\nintention and should be respected.\n\nWARNING! This check may be expensive on large source files.\n\nOptions\n¶\n\n\n\n\n\n\nCheckDestructors\n¶\n\n\nWhen \ntrue\n, destructors are analyzed to not throw exceptions.\nDefault value is \ntrue\n.\n\n\n\n\n\n\n\n\nCheckMoveMemberFunctions\n¶\n\n\nWhen \ntrue\n, move constructors and move assignment operators are analyzed\nto not throw exceptions. Default value is \ntrue\n.\n\n\n\n\n\n\n\n\nCheckMain\n¶\n\n\nWhen \ntrue\n, the \nmain()\n function is analyzed to not throw exceptions.\nDefault value is \ntrue\n.\n\n\n\n\n\n\n\n\nCheckNothrowFunctions\n¶\n\n\nWhen \ntrue\n, functions marked with \nnoexcept\n or \nthrow()\n exception\nspecifications are analyzed to not throw exceptions. Default value is \ntrue\n.\n\n\n\n\n\n\n\n\nCheckedSwapFunctions\n¶\n\n\nComma-separated list of swap function names which should not throw exceptions.\nDefault value is \nswap,iter_swap,iter_move\n.\n\n\n\n\n\n\n\n\nFunctionsThatShouldNotThrow\n¶\n\n\nComma separated list containing function names which should not throw. An\nexample value for this parameter can be \nWinMain\n which adds function\n\nWinMain()\n in the Windows API to the list of the functions which should\nnot throw. Default value is an empty string.\n\n\n\n\n\n\n\n\nIgnoredExceptions\n¶\n\n\nComma separated list containing type names which are not counted as thrown\nexceptions in the check. Default value is an empty string.",
    "configurations": []
  }
}