{
  "name": "bugprone-switch-missing-default-case",
  "meta": {
    "url": "https://clang.llvm.org/extra/clang-tidy/checks/bugprone/switch-missing-default-case.html",
    "fixable": false
  },
  "content": {
    "introduction": "Ensures that switch statements without default cases are flagged, focuses only\non covering cases with non-enums where the compiler may not issue warnings.\n\nSwitch statements without a default case can lead to unexpected\nbehavior and incomplete handling of all possible cases. When a switch statement\nlacks a default case, if a value is encountered that does not match any of the\nspecified cases, the switch statement will do nothing and the program will\ncontinue execution without handling the value.\n\nThis check helps identify switch statements that are missing a default case,\nallowing developers to ensure that all possible cases are handled properly.\nAdding a default case allows for graceful handling of unexpected or unmatched\nvalues, reducing the risk of program errors and unexpected behavior.\n\nExample:\n\n// Example 1:\n\n\n// warning: switching on non-enum value without default case may not cover all cases\n\n\nswitch\n \n(\ni\n)\n \n{\n\n\ncase\n \n0\n:\n\n\n  \nbreak\n;\n\n\n}\n\n\n\n// Example 2:\n\n\nenum\n \nE\n \n{\n \neE1\n \n};\n\n\nE\n \ne\n \n=\n \neE1\n;\n\n\nswitch\n \n(\ne\n)\n \n{\n \n// no-warning\n\n\ncase\n \neE1\n:\n\n\n  \nbreak\n;\n\n\n}\n\n\n\n// Example 3:\n\n\nint\n \ni\n \n=\n \n0\n;\n\n\nswitch\n \n(\ni\n)\n \n{\n \n// no-warning\n\n\ncase\n \n0\n:\n\n\n  \nbreak\n;\n\n\ndefault\n:\n\n\n  \nbreak\n;\n\n\n}\n\nNote\n\n\nEnum types are already covered by compiler warnings (comes under -Wswitch)\nwhen a switch statement does not handle all enum values. This check focuses\non non-enum types where the compiler warnings may not be present.\n\nSee also\n\n\nThe \nCppCoreGuideline ES.79\n\nprovide guidelines on switch statements, including the recommendation to\nalways provide a default case.",
    "configurations": []
  }
}