{
  "name": "misc-header-include-cycle",
  "meta": {
    "url": "https://clang.llvm.org/extra/clang-tidy/checks/misc/header-include-cycle.html",
    "fixable": false
  },
  "content": {
    "introduction": "Check detects cyclic \n#include\n dependencies between user-defined headers.\n\n// Header A.hpp\n\n\n#pragma once\n\n\n#include\n \n\"B.hpp\"\n\n\n\n// Header B.hpp\n\n\n#pragma once\n\n\n#include\n \n\"C.hpp\"\n\n\n\n// Header C.hpp\n\n\n#pragma once\n\n\n#include\n \n\"A.hpp\"\n\n\n\n// Include chain: A->B->C->A\n\nHeader files are a crucial part of many C++ programs as they provide a way to\norganize declarations and definitions shared across multiple source files.\nHowever, header files can also create problems when they become entangled\nin complex dependency cycles. Such cycles can cause issues with compilation\ntimes, unnecessary rebuilds, and make it harder to understand the overall\nstructure of the code.\n\nTo address these issues, a check has been developed to detect cyclic\ndependencies between header files, also known as “include cycles”.\nAn include cycle occurs when a header file \nA\n includes header file \nB\n,\nand \nB\n (or any subsequent included header file) includes back header file \nA\n,\nresulting in a circular dependency cycle.\n\nThis check operates at the preprocessor level and specifically analyzes\nuser-defined headers and their dependencies. It focuses solely on detecting\ninclude cycles while disregarding other types or function dependencies.\nThis specialized analysis helps identify and prevent issues related to header\nfile organization.\n\nBy detecting include cycles early in the development process, developers can\nidentify and resolve these issues before they become more difficult and\ntime-consuming to fix. This can lead to faster compile times, improved code\nquality, and a more maintainable codebase overall. Additionally, by ensuring\nthat header files are organized in a way that avoids cyclic dependencies,\ndevelopers can make their code easier to understand and modify over time.\n\nIt’s worth noting that only user-defined headers their dependencies are\nanalyzed, system includes such as standard library headers and third-party\nlibrary headers are excluded. System includes are usually well-designed and\nfree of include cycles, and ignoring them helps to focus on potential issues\nwithin the project’s own codebase. This limitation doesn’t diminish the\nability to detect \n#include\n cycles within the analyzed code.\n\nDevelopers should carefully review any warnings or feedback provided by this\nsolution. While the analysis aims to identify and prevent include cycles, there\nmay be situations where exceptions or modifications are necessary. It’s\nimportant to exercise judgment and consider the specific context of the\ncodebase when making adjustments.\n\nOptions\n¶\n\n\n\n\n\n\nIgnoredFilesList\n¶\n\n\nProvides a way to exclude specific files/headers from the warnings raised by\na check. This can be achieved by specifying a semicolon-separated list of\nregular expressions or filenames. This option can be used as an alternative\nto \n//NOLINT\n when using it is not possible.\nThe default value of this option is an empty string, indicating that no\nfiles are ignored by default.",
    "configurations": []
  }
}