{
  "name": "modernize-use-designated-initializers",
  "meta": {
    "url": "https://clang.llvm.org/extra/clang-tidy/checks/modernize/use-designated-initializers.html",
    "fixable": true
  },
  "content": {
    "introduction": "Finds initializer lists for aggregate types which could be written as\ndesignated initializers instead.\n\nWith plain initializer lists, it is very easy to introduce bugs when adding new\nfields in the middle of a struct or class type. The same confusion might arise\nwhen changing the order of fields.\n\nC++20 supports the designated initializer syntax for aggregate types. By\napplying it, we can always be sure that aggregates are constructed correctly,\nbecause every variable being initialized is referenced by its name.\n\nExample:\n\nstruct\n \nS\n \n{\n \nint\n \ni\n,\n \nj\n;\n \n};\n\nis an aggregate type that should be initialized as\n\nS\n \ns\n{\n.\ni\n \n=\n \n1\n,\n \n.\nj\n \n=\n \n2\n};\n\ninstead of\n\nS\n \ns\n{\n1\n,\n \n2\n};\n\nwhich could easily become an issue when \ni\n and \nj\n are swapped in the\ndeclaration of \nS\n.\n\nEven when compiling in a language version older than C++20, depending on your\ncompiler, designated initializers are potentially supported. Therefore, the\ncheck is by default restricted to C99/C++20 and above. Check out the options\n\n-Wc99-designator\n to get support for mixed designators in initializer list\nin C and \n-Wc++20-designator\n for support of designated initializers in older\nC++ language modes.\n\nOptions\n¶\n\n\n\n\n\n\nIgnoreMacros\n¶\n\n\nThe value \nfalse\n specifies that components of initializer lists expanded from\nmacros are not checked. The default value is \ntrue\n.\n\n\n\n\n\n\n\n\nIgnoreSingleElementAggregates\n¶\n\n\nThe value \nfalse\n specifies that even initializers for aggregate types with\nonly a single element should be checked. The default value is \ntrue\n.\n\nstd::array\n initializations are always excluded, as the type is a\nstandard library abstraction and not intended to be initialized with\ndesignated initializers.\n\n\n\n\n\n\n\n\nRestrictToPODTypes\n¶\n\n\nThe value \ntrue\n specifies that only Plain Old Data (POD) types shall be\nchecked. This makes the check applicable to even older C++ standards. The\ndefault value is \nfalse\n.\n\n\n\n\n\n\n\n\nStrictCStandardCompliance\n¶\n\n\nWhen set to \nfalse\n, the check will not restrict itself to C99 and above.\nThe default value is \ntrue\n.\n\n\n\n\n\n\n\n\nStrictCppStandardCompliance\n¶\n\n\nWhen set to \nfalse\n, the check will not restrict itself to C++20 and above.\nThe default value is \ntrue\n.",
    "configurations": []
  }
}