{
    "bugprone-forwarding-reference-overload": {
        "description": "Description\n\nThe check looks for perfect forwarding constructors that can hide copy or move\nconstructors. If a non const lvalue reference is passed to the constructor, the\nforwarding reference parameter will be a better match than the const reference\nparameter of the copy constructor, so the perfect forwarding constructor will\nbe called, which can be confusing.\nFor detailed description of this issue see: Scott Meyers, Effective Modern C++,\nItem 26.\n\nConsider the following example:\n\nclass\nPerson\n{\npublic\n:\n// C1: perfect forwarding ctor\ntemplate\n<\ntypename\nT\n>\nexplicit\nPerson\n(\nT\n&&\nn\n)\n{}\n// C2: perfect forwarding ctor with parameter default value\ntemplate\n<\ntypename\nT\n>\nexplicit\nPerson\n(\nT\n&&\nn\n,\nint\nx\n=\n1\n)\n{}\n// C3: perfect forwarding ctor guarded with enable_if\ntemplate\n<\ntypename\nT\n,\ntypename\nX\n=\nenable_if_t\n<\nis_special\n<\nT\n>\n,\nvoid\n>>\nexplicit\nPerson\n(\nT\n&&\nn\n)\n{}\n// C4: variadic perfect forwarding ctor guarded with enable_if\ntemplate\n<\ntypename\n...\nA\n,\nenable_if_t\n<\nis_constructible_v\n<\ntuple\n<\nstring\n,\nint\n>\n,\nA\n&&\n...\n>\n,\nint\n>\n=\n0\n>\nexplicit\nPerson\n(\nA\n&&\n...\na\n)\n{}\n// C5: perfect forwarding ctor guarded with requires expression\ntemplate\n<\ntypename\nT\n>\nrequires\nrequires\n{\nis_special\n<\nT\n>\n;\n}\nexplicit\nPerson\n(\nT\n&&\nn\n)\n{}\n// C6: perfect forwarding ctor guarded with concept requirement\ntemplate\n<\nSpecial\nT\n>\nexplicit\nPerson\n(\nT\n&&\nn\n)\n{}\n// (possibly compiler generated) copy ctor\nPerson\n(\nconst\nPerson\n&\nrhs\n);\n};\n\nThe check warns for constructors C1 and C2, because those can hide copy and\nmove constructors. We suppress warnings if the copy and the move constructors\nare both disabled (deleted or private), because there is nothing the perfect\nforwarding constructor could hide in this case. We also suppress warnings for\nconstructors like C3-C6 that are guarded with an\nenable_if\nor a concept,\nassuming the programmer was aware of the possible hiding.\n\nBackground\nFor deciding whether a constructor is guarded with enable_if, we consider the\ntypes of the constructor parameters, the default values of template type parameters\nand the types of non-type template parameters with a default literal value. If any\npart of these types is\nstd::enable_if\nor\nstd::enable_if_t\n, we assume the\nconstructor is guarded.",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nThis rule has no specific options."
    }
}