{
    "bugprone-crtp-constructor-accessibility": {
        "description": "Description\n\nDetects error-prone Curiously Recurring Template Pattern usage, when the CRTP\ncan be constructed outside itself and the derived class.\n\nThe CRTP is an idiom, in which a class derives from a template class, where\nitself is the template argument. It should be ensured that if a class is\nintended to be a base class in this idiom, it can only be instantiated if\nthe derived class is its template argument.\n\nExample:\n\ntemplate\n<\ntypename\nT\n>\nclass\nCRTP\n{\nprivate\n:\nCRTP\n()\n=\ndefault\n;\nfriend\nT\n;\n};\nclass\nDerived\n:\nCRTP\n<\nDerived\n>\n{};\n\nBelow can be seen some common mistakes that will allow the breaking of the\nidiom.\n\nIf the constructor of a class intended to be used in a CRTP is public, then\nit allows users to construct that class on its own.\n\nExample:\n\ntemplate\n<\ntypename\nT\n>\nclass\nCRTP\n{\npublic\n:\nCRTP\n()\n=\ndefault\n;\n};\nclass\nGood\n:\nCRTP\n<\nGood\n>\n{};\nGood\nGoodInstance\n;\nCRTP\n<\nint\n>\nBadInstance\n;\n\nIf the constructor is protected, the possibility of an accidental instantiation\nis prevented, however it can fade an error, when a different class is used as\nthe template parameter instead of the derived one.\n\nExample:\n\ntemplate\n<\ntypename\nT\n>\nclass\nCRTP\n{\nprotected\n:\nCRTP\n()\n=\ndefault\n;\n};\nclass\nGood\n:\nCRTP\n<\nGood\n>\n{};\nGood\nGoodInstance\n;\nclass\nBad\n:\nCRTP\n<\nGood\n>\n{};\nBad\nBadInstance\n;\n\nTo ensure that no accidental instantiation happens, the best practice is to\nmake the constructor private and declare the derived class as friend. Note\nthat as a tradeoff, this also gives the derived class access to every other\nprivate members of the CRTP. However, constructors can still be public or\nprotected if they are deleted.\n\nExample:\n\ntemplate\n<\ntypename\nT\n>\nclass\nCRTP\n{\nCRTP\n()\n=\ndefault\n;\nfriend\nT\n;\n};\nclass\nGood\n:\nCRTP\n<\nGood\n>\n{};\nGood\nGoodInstance\n;\nclass\nBad\n:\nCRTP\n<\nGood\n>\n{};\nBad\nCompileTimeError\n;\nCRTP\n<\nint\n>\nAlsoCompileTimeError\n;\n\nLimitations\nThe check is not supported below C++11\nThe check does not handle when the derived class is passed as a variadic\ntemplate argument\nAccessible functions that can construct the CRTP, like factory functions\nare not checked\nThe check also suggests a fix-its in some cases.",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nThis rule has no specific options."
    }
}