{
    "bugprone-compare-pointer-to-member-virtual-function": {
        "description": "Description\n\nDetects unspecified behavior about equality comparison between pointer to\nmember virtual function and anything other than null-pointer-constant.\n\nstruct\nA\n{\nvoid\nf1\n();\nvoid\nf2\n();\nvirtual\nvoid\nf3\n();\nvirtual\nvoid\nf4\n();\nvoid\ng1\n(\nint\n);\n};\nvoid\nfn\n()\n{\nbool\nr1\n=\n(\n&\nA\n::\nf1\n==\n&\nA\n::\nf2\n);\n// ok\nbool\nr2\n=\n(\n&\nA\n::\nf1\n==\n&\nA\n::\nf3\n);\n// bugprone\nbool\nr3\n=\n(\n&\nA\n::\nf1\n!=\n&\nA\n::\nf3\n);\n// bugprone\nbool\nr4\n=\n(\n&\nA\n::\nf3\n==\nnullptr\n);\n// ok\nbool\nr5\n=\n(\n&\nA\n::\nf3\n==\n&\nA\n::\nf4\n);\n// bugprone\nvoid\n(\nA\n::*\nv1\n)()\n=\n&\nA\n::\nf3\n;\nbool\nr6\n=\n(\nv1\n==\n&\nA\n::\nf1\n);\n// bugprone\nbool\nr6\n=\n(\nv1\n==\nnullptr\n);\n// ok\nvoid\n(\nA\n::*\nv2\n)()\n=\n&\nA\n::\nf2\n;\nbool\nr7\n=\n(\nv2\n==\n&\nA\n::\nf1\n);\n// false positive, but potential risk if assigning other value to v2.\nvoid\n(\nA\n::*\nv3\n)(\nint\n)\n=\n&\nA\n::\ng1\n;\nbool\nr8\n=\n(\nv3\n==\n&\nA\n::\ng1\n);\n// ok, no virtual function match void(A::*)(int) signature.\n}\n\nProvide warnings on equality comparisons involve pointers to member virtual\nfunction or variables which is potential pointer to member virtual function and\nany entity other than a null-pointer constant.\n\nIn certain compilers, virtual function addresses are not conventional pointers\nbut instead consist of offsets and indexes within a virtual function table\n(vtable). Consequently, these pointers may vary between base and derived\nclasses, leading to unpredictable behavior when compared directly. This issue\nbecomes particularly challenging when dealing with pointers to pure virtual\nfunctions, as they may not even have a valid address, further complicating\ncomparisons.\n\nInstead, it is recommended to utilize the\ntypeid\noperator or other\nappropriate mechanisms for comparing objects to ensure robust and predictable\nbehavior in your codebase. By heeding this detection and adopting a more reliable\ncomparison method, you can mitigate potential issues related to unspecified\nbehavior, especially when dealing with pointers to member virtual functions or pure\nvirtual functions, thereby improving the overall stability and maintainability\nof your code. In scenarios involving pointers to member virtual functions, it’s\nonly advisable to employ\nnullptr\nfor comparisons.\n\nLimitations\nDoes not analyze values stored in a variable. For variable, only analyze all\nvirtual methods in the same\nclass\nor\nstruct\nand diagnose when assigning\na pointer to member virtual function to this variable is possible.",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nThis rule has no specific options."
    }
}