{
    "misc-override-with-different-visibility": {
        "description": "Description\n\nFinds virtual function overrides with different visibility than the function\nin the base class. This includes for example if a virtual function declared as\nprivate\nis overridden and declared as\npublic\nin a subclass. The\ndetected change is the modification of visibility resulting from keywords\npublic\n,\nprotected\n,\nprivate\nat overridden virtual functions. The\ncheck applies to any normal virtual function and optionally to destructors or\noperators. Use of the\nusing\nkeyword is not considered as visibility\nchange by this check.\n\nclass\nA\n{\npublic\n:\nvirtual\nvoid\nf_pub\n();\nprivate\n:\nvirtual\nvoid\nf_priv\n();\n};\nclass\nB\n:\npublic\nA\n{\npublic\n:\nvoid\nf_priv\n();\n// warning: changed visibility from private to public\nprivate\n:\nvoid\nf_pub\n();\n// warning: changed visibility from public to private\n};\nclass\nC\n:\nprivate\nA\n{\n// no warning: f_pub becomes private in this case but this is from the\n// private inheritance\n};\nclass\nD\n:\nprivate\nA\n{\npublic\n:\nvoid\nf_pub\n();\n// warning: changed visibility from private to public\n// 'f_pub' would have private access but is forced to be\n// public\n};\n\nIf the visibility is changed in this way, it can indicate bad design or\nprogramming error.\n\nIf a virtual function is private in a subclass but public in the base class, it\ncan still be accessed from a pointer to the subclass if the pointer is converted\nto the base type. Probably private inheritance can be used instead.\n\nA protected virtual function that is made public in a subclass may have valid\nuse cases but similar (not exactly same) effect can be achieved with the\nusing\nkeyword.",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nOptions\nDisallowedVisibilityChange\nControls what kind of change to the visibility will be detected by the check.\nPossible values are\nany\n,\nwidening\n,\nnarrowing\n. For example the\nwidening\noption will produce warning only if the visibility is changed\nfrom more restrictive (\nprivate\n) to less restrictive (\npublic\n).\nDefault value is\nany\n.\nCheckDestructors\nIf\ntrue\n, the check does apply to destructors too. Otherwise destructors\nare ignored by the check.\nDefault value is\nfalse\n.\nCheckOperators\nIf\ntrue\n, the check does apply to overloaded C++ operators (as virtual\nmember functions) too. This includes other special member functions (like\nconversions) too. This option is probably useful only in rare cases because\noperators and conversions are not often virtual functions.\nDefault value is\nfalse\n.\nIgnoredFunctions\nThis option can be used to ignore the check at specific functions.\nTo configure this option, a semicolon-separated list of function names\nshould be provided. The list can contain regular expressions, in this way it\nis possible to select all functions of a specific class (like\nMyClass::.*\n)\nor a specific function of any class (like\nmy_function\nor\n::.*::my_function\n). The function names are matched at the base class.\nDefault value is empty string."
    }
}