{
    "performance-unnecessary-value-param": {
        "description": "Description\n\nFlags value parameter declarations of expensive to copy types that are copied\nfor each invocation but it would suffice to pass them by const reference.\n\nThe check is only applied to parameters of types that are expensive to copy\nwhich means they are not trivially copyable or have a non-trivial copy\nconstructor or destructor.\n\nTo ensure that it is safe to replace the value parameter with a const reference\nthe following heuristic is employed:\n\nthe parameter is const qualified;\nthe parameter is not const, but only const methods or operators are invoked\non it, or it is used as const reference or value argument in constructors or\nfunction calls.\n\nExample:\n\nvoid\nf\n(\nconst\nstring\nValue\n)\n{\n// The warning will suggest making Value a reference.\n}\nvoid\ng\n(\nExpensiveToCopy\nValue\n)\n{\n// The warning will suggest making Value a const reference.\nValue\n.\nConstMethd\n();\nExpensiveToCopy\nCopy\n(\nValue\n);\n}\n\nIf the parameter is not const, only copied or assigned once and has a\nnon-trivial move-constructor or move-assignment operator respectively the check\nwill suggest to move it.\n\nExample:\n\nvoid\nsetValue\n(\nstring\nValue\n)\n{\nField\n=\nValue\n;\n}\n\nWill become:\n\n#include\n<utility>\nvoid\nsetValue\n(\nstring\nValue\n)\n{\nField\n=\nstd\n::\nmove\n(\nValue\n);\n}\n\nBecause the fix-it needs to change the signature of the function, it may break\nbuilds if the function is used in multiple translation units or some codes\ndepends on function signatures.",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nOptions\nIncludeStyle\nA string specifying which include-style is used,\nllvm\nor\ngoogle\n. Default\nis\nllvm\n.\nAllowedTypes\nA semicolon-separated list of names of types allowed to be passed by value.\nRegular expressions are accepted, e.g.\n[Rr]ef(erence)?$\nmatches every\ntype with suffix\nRef\n,\nref\n,\nReference\nand\nreference\n. The\ndefault is empty. If a name in the list contains the sequence\n::\n, it is\nmatched against the qualified type name (i.e.\nnamespace::Type\n),\notherwise it is matched against only the type name (i.e.\nType\n).\nIgnoreCoroutines\nA boolean specifying whether the check should suggest passing parameters by\nreference in coroutines. Passing parameters by reference in coroutines may\nnot be safe, please see\ncppcoreguidelines-avoid-reference-coroutine-parameters\nfor more information. Default is\ntrue\n."
    }
}