{
    "performance-unnecessary-copy-initialization": {
        "description": "Description\n\nFinds local variable declarations that are initialized using the copy\nconstructor of a non-trivially-copyable type but it would suffice to obtain a\nconst reference.\n\nThe check is only applied if it is safe to replace the copy by a const\nreference. This is the case when the variable is const qualified or when it is\nonly used as a const, i.e. only const methods or operators are invoked on it,\nor it is used as const reference or value argument in constructors or function\ncalls.\n\nExample:\n\nconst\nstring\n&\nconstReference\n();\nvoid\nFunction\n()\n{\n// The warning will suggest making this a const reference.\nconst\nstring\nUnnecessaryCopy\n=\nconstReference\n();\n}\nstruct\nFoo\n{\nconst\nstring\n&\nname\n()\nconst\n;\n};\nvoid\nFunction\n(\nconst\nFoo\n&\nfoo\n)\n{\n// The warning will suggest making this a const reference.\nstring\nUnnecessaryCopy1\n=\nfoo\n.\nname\n();\nUnnecessaryCopy1\n.\nfind\n(\n\"bar\"\n);\n// The warning will suggest making this a const reference.\nstring\nUnnecessaryCopy2\n=\nUnnecessaryCopy1\n;\nUnnecessaryCopy2\n.\nfind\n(\n\"bar\"\n);\n}",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nOptions\nAllowedTypes\nA semicolon-separated list of names of types allowed to be initialized by\ncopying. Regular expressions are accepted, e.g.\n[Rr]ef(erence)?$\nmatches\nevery type with suffix\nRef\n,\nref\n,\nReference\nand\nreference\n.\nThe default is empty. If a name in the list contains the sequence\n::\n, it\nis matched against the qualified type name (i.e.\nnamespace::Type\n),\notherwise it is matched against only the type name (i.e.\nType\n).\nExcludedContainerTypes\nA semicolon-separated list of names of types whose methods are allowed to\nreturn the const reference the variable is copied from. When an expensive to\ncopy variable is copy initialized by the return value from a type on this\nlist the check does not trigger. This can be used to exclude types known to\nbe const incorrect or where the lifetime or immutability of returned\nreferences is not tied to mutations of the container. An example are view\ntypes that don’t own the underlying data. Like for\nAllowedTypes\nabove,\nregular expressions are accepted and the inclusion of\n::\ndetermines whether\nthe qualified typename is matched or not.\n\nLimitations\nThis check does not perform lifetime analysis and may suggest replacing copies\nwith const references that could become dangling. Be cautious when the\nreferenced object might be invalidated by subsequent operations.\nvoid\nconsume\n(\nconst\nS\n&\n);\nvoid\nfunc\n(\nstd\n::\nvector\n<\nS\n>\n&\nVec\n)\n{\nconst\nauto\nIt\n=\nVec\n.\nbegin\n();\nconst\nS\nValue\n(\n*\nIt\n);\n// The warning will suggest making this a const reference.\nVec\n.\nerase\n(\nIt\n);\n// Container modifications could invalidate references.\nconsume\n(\nValue\n);\n// Safe with copy, dangling reference otherwise.\n}"
    }
}