{
    "readability-operators-representation": {
        "description": "Description\n\nEnforces consistent token representation for invoked binary, unary and\noverloaded operators in C++ code. The check supports both traditional and\nalternative representations of operators, such as\n&&\nand\nand\n,\n||\nand\nor\n, and so on.\n\nIn the realm of C++ programming, developers have the option to choose between\ntwo distinct representations for operators: traditional token representation\nand alternative token representation. Traditional tokens utilize symbols,\nsuch as\n&&\n,\n||\n, and\n!\n, while alternative tokens employ more\ndescriptive words like\nand\n,\nor\n, and\nnot\n.\n\nIn the following mapping table, a comprehensive list of traditional and\nalternative tokens, along with their corresponding representations,\nis presented:\n\nToken Representation Mapping Table\nTraditional\nAlternative\n&&\nand\n&=\nand_eq\n&\nbitand\n|\nbitor\n~\ncompl\n!\nnot\n!=\nnot_eq\n||\nor\n|=\nor_eq\n^\nxor\n^=\nxor_eq\n\nExample\n// Traditional Token Representation:\nif\n(\n!\na\n||!\nb\n)\n{\n// do something\n}\n// Alternative Token Representation:\nif\n(\nnot\na\nor\nnot\nb\n)\n{\n// do something\n}",
        "option": "Static analysis (Clang-Tidy) options are configured via .clang-tidy file.\n\nOptions\nDue to the distinct benefits and drawbacks of each representation, the default\nconfiguration doesn’t enforce either. Explicit configuration is needed.\nTo configure check to enforce Traditional Token Representation for all\noperators set options to\n&&;&=;&;|;~;!;!=;||;|=;^;^=\n.\nTo configure check to enforce Alternative Token Representation for all\noperators set options to\nand;and_eq;bitand;bitor;compl;not;not_eq;or;or_eq;xor;xor_eq\n.\nDevelopers do not need to enforce all operators, and can mix the\nrepresentations as desired by specifying a semicolon-separated list of\nboth traditional and alternative tokens in the configuration,\nsuch as\nand;||;not\n.\nBinaryOperators\nThis option allows you to specify a semicolon-separated list of binary\noperators for which you want to enforce specific token representation.\nThe default value is empty string.\nOverloadedOperators\nThis option allows you to specify a semicolon-separated list of overloaded\noperators for which you want to enforce specific token representation.\nThe default value is empty string."
    }
}