{
  "description": "[Status: stable] [Name: batched-without-explicit-strict] [Message: <code>itertools.batched()</code> without an explicit <code>strict</code> parameter] What it does Checks for itertools.batched calls without an explicit strict parameter. Why is this bad? By default, if the length of the iterable is not divisible by the second argument to itertools.batched, the last batch will be shorter than the rest. In Python 3.13, a strict parameter was added which allows controlling if the batches must be of uniform length. Pass strict=True to raise a ValueError if the batches are of non-uniform length. Otherwise, pass strict=False to make the intention explicit. Example import itertools itertools.batched(iterable, n) Use instead if the batches must be of uniform length: import itertools itertools.batched(iterable, n, strict=True) Or if the batches can be of non-uniform length: import itertools itertools.batched(iterable, n, strict=False) Known deviations Unlike the upstream B911, this rule will not report infinite iterators (e.g., itertools.cycle(...)).",
  "option": {
    "target-version": {
      "option_description": "The minimum Python version to target, e.g., when considering automatic\ncode upgrades, like rewriting type annotations. Ruff will not propose\nchanges using features that are not available in the given version.\n\nFor example, to represent supporting Python >=3.11 or ==3.11\nspecify target-version = \"py311\".\n\nIf you're already using a pyproject.toml file, we recommend\nproject.requires-python instead, as it's based on Python packaging\nstandards, and will be respected by other tools. For example, Ruff\ntreats the following as identical to target-version = \"py38\":\n\n[project]\nrequires-python = \">=3.8\"\n\nIf both are specified, target-version takes precedence over\nrequires-python. See Inferring the Python version\nfor a complete description of how the target-version is determined\nwhen left unspecified.\n\nNote that a stub file can sometimes make use of a typing feature\nbefore it is available at runtime, as long as the stub does not make\nuse of new syntax. For example, a type checker will understand\nint | str in a stub as being a Union type annotation, even if the\ntype checker is run using Python 3.9, despite the fact that the |\noperator can only be used to create union types at runtime on Python\n3.10+. As such, Ruff will often recommend newer features in a stub\nfile than it would for an equivalent runtime file with the same target\nversion.\n\n\n\nExample usage:\n\npyproject.tomlruff.toml\n\n\n[tool.ruff]\n# Always generate Python 3.7-compatible code.\ntarget-version = \"py37\"\n\n\n\n# Always generate Python 3.7-compatible code.\ntarget-version = \"py37\"",
      "option_data_type": "\"py37\" | \"py38\" | \"py39\" | \"py310\" | \"py311\" | \"py312\" | \"py313\" | \"py314\"",
      "default_value": "\"py310\"",
      "option_values": {
        "valuelist": []
      }
    }
  }
}