{
  "description": "[Status: stable] [Name: unused-import] [Message: <code>{name}</code> imported but unused; consider using <code>importlib.util.find_spec</code> to test for availability] What it does Checks for unused imports. Why is this bad? Unused imports add a performance overhead at runtime, and risk creating import cycles. They also increase the cognitive load of reading the code. If an import statement is used to check for the availability or existence of a module, consider using importlib.util.find_spec instead. If an import statement is used to re-export a symbol as part of a module's public interface, consider using a \"redundant\" import alias, which instructs Ruff (and other tools) to respect the re-export, and avoid marking it as unused, as in: from module import member as member Alternatively, you can use __all__ to declare a symbol as part of the module's interface, as in: # __init__.py import some_module __all__ = [\"some_module\"] Preview When preview is enabled (and certain simplifying assumptions are met), we analyze all import statements for a given module when determining whether an import is used, rather than simply the last of these statements. This can result in both different and more import statements being marked as unused. For example, if a module consists of import a import a.b then both statements are marked as unused under preview, whereas only the second is marked as unused under stable behavior. As another example, if a module consists of import a.b import a a.b.foo() then a diagnostic will only be emitted for the first line under preview, whereas a diagnostic would only be emitted for the second line under stable behavior. Note that this behavior is somewhat subjective and is designed to conform to the developer's intuition rather than Python's actual execution. To wit, the statement import a.b automatically executes import a, so in some sense import a is always redundant in the presence of import a.b. Fix safety Fixes to remove unused imports are safe, except in __init__.py files. Applying fixes to __init__.py files is currently in preview. The fix offered depends on the type of the unused import. Ruff will suggest a safe fix to export first-party imports with either a redundant alias or, if already present in the file, an __all__ entry. If multiple __all__ declarations are present, Ruff will not offer a fix. Ruff will suggest an unsafe fix to remove third-party and standard library imports -- the fix is unsafe because the module's interface changes. See this FAQ section for more details on how Ruff determines whether an import is first or third-party. Example import numpy as np # unused import def area(radius): return 3.14 * radius**2 Use instead: def area(radius): return 3.14 * radius**2 To check the availability of a module, use importlib.util.find_spec: from importlib.util import find_spec if find_spec(\"numpy\") is not None: print(\"numpy is installed\") else: print(\"numpy is not installed\")",
  "option": {
    "lint.ignore-init-module-imports": {
      "option_description": "Deprecated\nThis option has been deprecated in 0.4.4. ignore-init-module-imports will be removed in a future version because F401 now recommends appropriate fixes for unused imports in __init__.py (currently in preview mode). See documentation for more information and please update your configuration.\n\nAvoid automatically removing unused imports in __init__.py files. Such\nimports will still be flagged, but with a dedicated message suggesting\nthat the import is either added to the module's __all__ symbol, or\nre-exported with a redundant alias (e.g., import os as os).\n\nThis option is enabled by default, but you can opt-in to removal of imports\nvia an unsafe fix.\n\n\n\nExample usage:\n\npyproject.tomlruff.toml\n\n\n[tool.ruff.lint]\nignore-init-module-imports = false\n\n\n\n[lint]\nignore-init-module-imports = false",
      "option_data_type": "bool",
      "default_value": "true",
      "option_values": {
        "valuelist": []
      }
    },
    "lint.pyflakes.allowed-unused-imports": {
      "option_description": "A list of modules to ignore when considering unused imports.\n\nUsed to prevent violations for specific modules that are known to have side effects on\nimport (e.g., hvplot.pandas).\n\nModules in this list are expected to be fully-qualified names (e.g., hvplot.pandas). Any\nsubmodule of a given module will also be ignored (e.g., given hvplot, hvplot.pandas\nwill also be ignored).\n\n\n\nExample usage:\n\npyproject.tomlruff.toml\n\n\n[tool.ruff.lint.pyflakes]\nallowed-unused-imports = [\"hvplot.pandas\"]\n\n\n\n[lint.pyflakes]\nallowed-unused-imports = [\"hvplot.pandas\"]",
      "option_data_type": "list[str]",
      "default_value": "[]",
      "option_values": {
        "valuelist": []
      }
    }
  }
}