{
    "isort": {
        "description": "Description\n\nOptions for the `isort` plugin.",
        "option": "Type: IsortOptions/null\nStatus: DEPRECATED\n\nAvailable Sub-options:\n  - case-sensitive: Sort imports taking into account case sensitivity.\n  - classes: An override list of tokens to always recognize as a Class for\n  - combine-as-imports: Combines as imports on the same line. See isort's [`combine-as-imports`](https://pycqa.github.io/isort/docs/configuration/options.html#combine-as-imports)\n  - constants: An override list of tokens to always recognize as a CONSTANT\n  - default-section: Define a default section for any imports that don't fit into the specified [`section-order`](#lint_isort_section-order).\n  - detect-same-package: Whether to automatically mark imports from within the same package as first-party.\n  - extra-standard-library: A list of modules to consider standard-library, in addition to those\n  - force-single-line: Forces all from imports to appear on their own line.\n  - force-sort-within-sections: Don't sort straight-style imports (like `import sys`) before from-style\n  - force-to-top: Force specific imports to the top of their appropriate section.\n  - force-wrap-aliases: Force `import from` statements with multiple members and at least one\n  - forced-separate: A list of modules to separate into auxiliary block(s) of imports,\n  - from-first: Whether to place `import from` imports before straight imports when sorting.\n  - known-first-party: A list of modules to consider first-party, regardless of whether they\n  - known-local-folder: A list of modules to consider being a local folder.\n  - known-third-party: A list of modules to consider third-party, regardless of whether they\n  - length-sort: Sort imports by their string length, such that shorter imports appear\n  - length-sort-straight: Sort straight imports by their string length. Similar to [`length-sort`](#lint_isort_length-sort),\n  - lines-after-imports: The number of blank lines to place after imports.\n  - lines-between-types: The number of lines to place between \"direct\" and `import from` imports.\n  - no-lines-before: A list of sections that should _not_ be delineated from the previous\n  - no-sections: Put all imports into the same section bucket.\n  - order-by-type: Order imports by type, which is determined by case, in addition to\n  - relative-imports-order: Whether to place \"closer\" imports (fewer `.` characters, most local)\n  - required-imports: Add the specified import line to all files.\n  - section-order: Override in which order the sections should be output. Can be used to move custom sections.\n  - sections: A list of mappings from section names to modules.\n  - single-line-exclusions: One or more modules to exclude from the single line rule.\n  - split-on-trailing-comma: If a comma is placed after the last member in a multi-line import, then\n  - variables: An override list of tokens to always recognize as a var"
    }
}