{
    "ApexCRUDViolation": {
        "description": "Description\n\nThe rule validates you are checking for access permissions before a SOQL/SOSL/DML operation.\nSince Apex runs by default in system mode not having proper permissions checks results in escalation of\nprivilege and may produce runtime errors. This check forces you to handle such scenarios.\n\nSince Winter ‘23 (API Version 56) you can enforce user mode for database operations by usingWITH USER_MODEin SOQL. This makes Apex to respect Field-level security (FLS) and object\npermissions of the running user. When using user mode, no violation is reported by this rule.\n\nNote: This rule will produce false positives for VF getter methods. In VF getters the access permission\ncheck happens automatically and is not needed explicitly. However, the rule can’t reliably determine\nwhether a getter is a VF getter or not and reports a violation in any case. In such cases, the violation\nshould besuppressed.\n\nExample(s):\n\nUse this rule with the default properties by just referencing it:\n\nUse this rule and customize it:",
        "option": "Name\tDefault Value\tDescription\nreadAuthMethodPattern\t\tA regular expression for one or more custom read authorization method name patterns.\nreadAuthMethodTypeParamIndex\t0\tThe 0-based index of the sObjectType parameter for the custom read authorization method. Defaults to 0.\nmergeAuthMethodPattern\t\tA regular expression for one or more custom merge authorization method name patterns.\nmergeAuthMethodTypeParamIndex\t0\tThe 0-based index of the sObjectType parameter for the custom merge authorization method. Defaults to 0.\nupdateAuthMethodPattern\t\tA regular expression for one or more custom update authorization method name patterns.\nupdateAuthMethodTypeParamIndex\t0\tThe 0-based index of the sObjectType parameter for the custom update authorization method. Defaults to 0.\ncreateAuthMethodPattern\t\tA regular expression for one or more custom create authorization method name patterns.\ncreateAuthMethodTypeParamIndex\t0\tThe 0-based index of the sObjectType parameter for the custom create authorization method. Defaults to 0.\ndeleteAuthMethodPattern\t\tA regular expression for one or more custom delete authorization method name patterns.\ndeleteAuthMethodTypeParamIndex\t0\tThe 0-based index of the sObjectType parameter for the custom delete authorization method. Defaults to 0.\nundeleteAuthMethodPattern\t\tA regular expression for one or more custom undelete authorization method name patterns.\nundeleteAuthMethodTypeParamIndex\t0\tThe 0-based index of the sObjectType parameter for the custom undelete authorization method. Defaults to 0."
    }
}