{
    "linebreak-style": {
        "description": "Description\n\nThis rule enforces consistent line endings independent of operating system, VCS, or editor used across your codebase.\n\nOptions\n\nThis rule has a string option:\n\n- \"unix\"(default) enforces the usage of Unix line endings:\\nfor LF.\n- \"windows\"enforces the usage of Windows line endings:\\r\\nfor CRLF.\n\nunix\n\nExamples ofincorrectcode for this rule with the default\"unix\"option:\n\n/*eslint linebreak-style: [\"error\", \"unix\"]*/\n\nvar a = 'a'; // \\r\\n\n\nExamples ofcorrectcode for this rule with the default\"unix\"option:\n\n/*eslint linebreak-style: [\"error\", \"unix\"]*/\n\nvar a = 'a', // \\n\n    b = 'b'; // \\n\n// \\n\nfunction foo(params) { // \\n\n    // do stuff \\n\n}// \\n\n\nwindows\n\nExamples ofincorrectcode for this rule with the\"windows\"option:\n\n/*eslint linebreak-style: [\"error\", \"windows\"]*/\n\nvar a = 'a'; // \\n\n\nExamples ofcorrectcode for this rule with the\"windows\"option:\n\n/*eslint linebreak-style: [\"error\", \"windows\"]*/ // \\r\\n\n// \\r\\n\nvar a = 'a', // \\r\\n\n    b = 'b'; // \\r\\n\n// \\r\\n\nfunction foo(params) { // \\r\\n\n    // do stuff \\r\\n\n} // \\r\\n\n\nUsing this rule with version control systems\n\nVersion control systems sometimes have special behavior for linebreaks. To make it easy for developers to contribute to your codebase from different platforms, you may want to configure your VCS to handle linebreaks appropriately.\n\nFor example, the default behavior ofgiton Windows systems is to convert LF linebreaks to CRLF when checking out files, but to store the linebreaks as LF when committing a change. This will cause thelinebreak-stylerule to report errors if configured with the\"unix\"setting, because the files that ESLint sees will have CRLF linebreaks. If you use git, you may want to add a line to your.gitattributesfileto prevent git from converting linebreaks in.jsfiles:\n\n*.js text eol=lf",
        "option": "This rule has no specific options."
    }
}