{
    "name": "AvoidCatchingGenericException",
    "category": "errorprone",
    "summary": "Avoid catching generic exceptions in try-catch blocks. Catching overly broad exception types makes it difficult\nto understand what can actually go wrong in your code and can hide real problems.\n\n**Why these exceptions should not be caught:**\n\n* **Exception**: This is the base class for all checked exceptions. Catching it means you're handling all possible\nchecked exceptions the same way, which is rarely appropriate and makes error handling less precise.\n\n* **RuntimeException**: These represent programming errors (like logic bugs) that should typically be fixed in\ncode rather than caught and handled. Catching them can hide bugs that should be addressed during development.\n\n* **NullPointerException**: This usually indicates a programming error (accessing null references). Rather than\ncatching it, code should be written to avoid null pointer dereferences through null checks or defensive programming.\n\n* **Throwable**: This is the superclass of all errors and exceptions. Catching it means you're trying to handle\nboth recoverable exceptions and serious errors (like OutOfMemoryError) the same way, which is dangerous.\n\n* **Error**: These represent serious problems that applications should not try to handle (like OutOfMemoryError,\nStackOverflowError). Catching Error can prevent the JVM from properly terminating when it encounters unrecoverable situations.\n\n**Better approaches:**\n- Catch specific exception types that you can meaningfully handle\n- Use multiple catch blocks for different exception types that require different handling\n- Consider using defensive programming techniques to prevent exceptions rather than catching them",
    "message": "Avoid catching {0} in try-catch block",
    "url": "${pmd.website.baseurl}/pmd_rules_java_errorprone.html#avoidcatchinggenericexception",
    "since": "4.2.6",
    "priority": "3",
    "is_deprecated": false,
    "configuration": [
        {
            "name": "typesThatShouldNotBeCaught",
            "description": "List of canonical type names that should trigger a violation if used in a catch clause.",
            "defaultValue": "",
            "type": "List[String]"
        }
    ],
    "examples": "public class PrimitiveType {\npublic void downCastPrimitiveType(int i) {\ntry {\nSystem.out.println(\" i [\" + i + \"]\");\n} catch(NullPointerException e) {\ne.printStackTrace();\n} catch(RuntimeException e) {\ne.printStackTrace();\n} catch(Exception e) {\ne.printStackTrace();\n}\n}\n}"
}