{"rule_name": {"description": "Description\n\nValidates abbreviations (consecutive capital letters) length in identifier name,\nit also allows to enforce camel case naming. Please read more at\n\nGoogle Style Guide\nto get to know how to avoid long abbreviations in names.\n\n'_' is considered as word separator in identifier name.\n\nallowedAbbreviationLength specifies how many consecutive capital letters are\nallowed in the identifier.\nA value of 3 indicates that up to 4 consecutive capital letters are allowed,\none after the other, before a violation is printed. The identifier 'MyTEST' would be\nallowed, but 'MyTESTS' would not be.\nA value of 0 indicates that only 1 consecutive capital letter is allowed. This\nis what should be used to enforce strict camel casing. The identifier 'MyTest' would\nbe allowed, but 'MyTEst' would not be.\n\n\nignoreFinal, ignoreStatic, and ignoreStaticFinal\ncontrol whether variables with the respective modifiers are to be ignored.\nNote that a variable that is both static and final will always be considered under\nignoreStaticFinal only, regardless of the values of ignoreFinal\nand ignoreStatic. So for example if ignoreStatic is true but\nignoreStaticFinal is false, then static final variables will not be ignored.", "option": "\nallowedAbbreviationLength, Indicate the number of consecutive capital letters allowed in targeted identifiers (abbreviations in the classes, interfaces, variables and methods names, ... )., int, 3\nallowedAbbreviations, Specify abbreviations that must be skipped for checking., String[], {}\nignoreFinal, Allow to skip variables with final modifier., boolean, true\nignoreOverriddenMethods, Allow to ignore methods tagged with @Override annotation (that usually mean inherited name)., boolean, true\nignoreStatic, Allow to skip variables with static modifier., boolean, true\nignoreStaticFinal, Allow to skip variables with both static and final modifiers., boolean, true\ntokens, tokens to check, subset of tokens\n\nCLASS_DEF\n,\nINTERFACE_DEF\n,\nENUM_DEF\n,\nANNOTATION_DEF\n,\nANNOTATION_FIELD_DEF\n,\nPARAMETER_DEF\n,\nVARIABLE_DEF\n,\nMETHOD_DEF\n,\nENUM_CONSTANT_DEF\n,\nPATTERN_VARIABLE_DEF\n,\nRECORD_DEF\n,\nRECORD_COMPONENT_DEF\n.\n,\n\nCLASS_DEF\n,\nINTERFACE_DEF\n,\nENUM_DEF\n,\nANNOTATION_DEF\n,\nANNOTATION_FIELD_DEF\n,\nPARAMETER_DEF\n,\nVARIABLE_DEF\n,\nMETHOD_DEF\n,\nPATTERN_VARIABLE_DEF\n,\nRECORD_DEF\n,\nRECORD_COMPONENT_DEF\n.\n"}}