{"AnnotationUseStyle": {"description": "Description\n\nChecks the style of elements in annotations.\n\n\nAnnotations have three element styles starting with the least verbose.\n\n\nElementStyleOption.COMPACT_NO_ARRAY\nElementStyleOption.COMPACT\nElementStyleOption.EXPANDED\n\n\nTo not enforce an element style a ElementStyleOption.IGNORE type is provided.\nThe desired style can be set through the elementStyle property.\n\n\nUsing the ElementStyleOption.EXPANDED style is more verbose.\nThe expanded version is sometimes referred to as \"named parameters\" in other languages.\n\n\nUsing the ElementStyleOption.COMPACT style is less verbose.\nThis style can only be used when there is an element called 'value' which is either\nthe sole element or all other elements have default values.\n\n\nUsing the ElementStyleOption.COMPACT_NO_ARRAY style is less verbose.\nIt is similar to the ElementStyleOption.COMPACT style but single value arrays\nare flagged.\nWith annotations a single value array does not need to be placed in an array initializer.\n\n\nThe ending parenthesis are optional when using annotations with no elements.\nTo always require ending parenthesis use the ClosingParensOption.ALWAYS type.\nTo never have ending parenthesis use the ClosingParensOption.NEVER type.\nTo not enforce a closing parenthesis preference a ClosingParensOption.IGNORE\ntype is provided. Set this through the closingParens property.\n\n\nAnnotations also allow you to specify arrays of elements in a standard format.\nAs with normal arrays, a trailing comma is optional.\nTo always require a trailing comma use the TrailingArrayCommaOption.ALWAYS\ntype.\nTo never have a trailing comma use the TrailingArrayCommaOption.NEVER type.\nTo not enforce a trailing array comma preference a\nTrailingArrayCommaOption.IGNORE type is provided.\nSet this through the trailingArrayComma property.\n\n\nBy default, the ElementStyleOption is set to COMPACT_NO_ARRAY,\nthe TrailingArrayCommaOption is set to NEVER,\nand the ClosingParensOption is set to NEVER.\n\n\nAccording to the JLS, it is legal to include a trailing comma\nin arrays used in annotations but Sun's Java 5 & 6 compilers will not\ncompile with this syntax. This may in be a bug in Sun's compilers\nsince eclipse 3.4's built-in compiler does allow this syntax as\ndefined in the JLS. Note: this was tested with compilers included with\nJDK versions 1.5.0.17 and 1.6.0.11 and the compiler included with eclipse 3.4.1.\n\n\nSee\nJava Language specification, §9.7.", "option": "\nclosingParens, Define the policy for ending parenthesis., ClosingParensOption, never\nelementStyle, Define the annotation element styles., ElementStyleOption, compact_no_array\ntrailingArrayComma, Define the policy for trailing comma in arrays., TrailingArrayCommaOption, never"}}