{"ImportOrder": {"description": "Description\nChecks the ordering/grouping of imports. Features are:\n\ngroups type/static imports: ensures that groups of imports come in a\nspecific order (e.g., java. comes first, javax. comes second,\nthen everything else)\nadds a separation between type import groups : ensures that a blank\nline sit between each group\ntype/static import groups aren't separated internally: ensures that\neach group aren't separated internally by blank line or comment\nsorts type/static imports inside each group: ensures that imports\nwithin each group are in lexicographic order\n\nsorts according to case: ensures that the comparison\nbetween imports is case-sensitive, in\nASCII sort order\n\n\narrange static imports: ensures the relative order between\ntype imports and static imports (see\nImportOrderOption)", "option": "\ncaseSensitive, Control whether string comparison should be case-sensitive or not. Case-sensitive sorting is in ASCII sort order. It affects both type imports and static imports., boolean, true\ngroups, Specify list of type import groups. Every group identified either by a common prefix string, or by a regular expression enclosed in forward slashes (e.g. /regexp/). All type imports, which does not match any group, falls into an additional group, located at the end. Thus, the empty list of type groups (the default value) means one group for all type imports., Pattern[], {}\noption, Specify policy on the relative order between type imports and static imports., ImportOrderOption, under\nordered, Control whether type imports within each group should be sorted. It doesn't affect sorting for static imports., boolean, true\nseparated, Control whether type import groups should be separated by, at least, one blank line or comment and aren't separated internally. It doesn't affect separations for static imports., boolean, false\nseparatedStaticGroups, Control whether static import groups should be separated by, at least, one blank line or comment and aren't separated internally. This property has effect only when the property option is set to top or bottom and when property staticGroups is enabled., boolean, false\nsortStaticImportsAlphabetically, Control whether static imports located at top or bottom are sorted within the group., boolean, false\nstaticGroups, Specify list of static import groups. Every group identified either by a common prefix string, or by a regular expression enclosed in forward slashes (e.g. /regexp/). All static imports, which does not match any group, fall into an additional group, located at the end. Thus, the empty list of static groups (the default value) means one group for all static imports. This property has effect only when the property option is set to top or bottom., Pattern[], {}\nuseContainerOrderingForStatic, Control whether to use container ordering (Eclipse IDE term) for static imports or not., boolean, false"}}