{"rule_name": {"description": "Description\n\nChecks the Javadoc of a method or constructor.\n\n\nViolates parameters and type parameters\nfor which no param tags are\npresent can be suppressed by defining property\nallowMissingParamTags.\n\n\nViolates methods which return non-void but for which no return tag is\npresent can be suppressed by defining property\nallowMissingReturnTag.\n\n\nViolates exceptions which are declared to be thrown (by throws in the method\nsignature or by throw new in the method body), but for which no throws tag is\npresent by activation of property validateThrows.\nNote that throw new is not checked in the following places:\n\n\n\nInside a try block (with catch). It is not possible to determine if the thrown\nexception can be caught by the catch block as there is no knowledge of the\ninheritance hierarchy, so the try block is ignored entirely. However, catch\nand finally blocks, as well as try blocks without catch, are still checked.\n\n\nLocal classes, anonymous classes and lambda expressions. It is not known when the\nthrow statements inside such classes are going to be evaluated, so they are ignored.\n\n\n\nATTENTION: Checkstyle does not have information about hierarchy of exception types\nso usage of base class is considered as separate exception type.\nAs workaround, you need to specify both types in javadoc (parent and exact type).\n\n\nJavadoc is not required on a method that is tagged with the\n@Override annotation. However, under\nJava 5 it is not possible to mark a method required for an\ninterface (this was corrected under Java 6). Hence,\nCheckstyle supports using the convention of using a single\n{@inheritDoc} tag instead of all the\nother tags.\n\n\nNote that only inheritable items will allow the\n{@inheritDoc} tag to be used in place\nof comments. Static methods at all visibilities, private non-static\nmethods and constructors are not inheritable.\n\n\nFor example, if the following method is\nimplementing a method required by an interface, then the\nJavadoc could be done as:\n\n\n\n/** {@inheritDoc} */\npublic int checkReturnTag(final int aTagIndex,\nJavadocTag[] aTags,\nint aLineNo)", "option": "\naccessModifiers, Specify the access modifiers where Javadoc comments are checked., AccessModifierOption[], public, protected, package, private\nallowMissingParamTags, Control whether to ignore violations when a method has parameters but does not have matching param tags in the javadoc., boolean, false\nallowMissingReturnTag, Control whether to ignore violations when a method returns non-void type and does not have a return tag in the javadoc., boolean, false\nallowedAnnotations, Specify annotations that allow missed documentation., String[], Override\nvalidateThrows, Control whether to validate throws tags., boolean, false\ntokens, tokens to check, subset of tokens\n\nMETHOD_DEF\n,\nCTOR_DEF\n,\nANNOTATION_FIELD_DEF\n,\nCOMPACT_CTOR_DEF\n.\n,\n\nMETHOD_DEF\n,\nCTOR_DEF\n,\nANNOTATION_FIELD_DEF\n,\nCOMPACT_CTOR_DEF\n.\n"}}