{"Regexp": {"description": "Description\n\nChecks that a specified pattern exists, exists less\nthan a set number of times, or does not exist in the file.\n\n\nThis check combines all the functionality provided by\nRegexpHeader\nexcept supplying the regular expression from a file.\n\n\nIt differs from them in that it works in multiline mode.\nIts regular expression can span multiple lines and it checks this\nagainst the whole file at once.\nThe others work in single-line mode.\nTheir single or multiple regular expressions can only span one line.\nThey check each of these against each line in the file in turn.\n\n\nNote: Because of the different mode of operation there may be\nsome changes in the regular expressions used to achieve a particular end.\n\nIn multiline mode...\n\n^ means the beginning of a line, as opposed to beginning of the\ninput.\nFor beginning of the input use \\A.\n$ means the end of a line, as opposed to the end of the input.\nFor end of input use \\Z.\nEach line in the file is terminated with a line feed character.\n\n\nNote: Not all regular expression engines are created equal. Some provide extra\nfunctions that others do not and some elements of the syntax may vary.\nThis check makes use of the\n\njava.util.regex package; please check its documentation for\ndetails of how to construct a regular expression to achieve a particular\ngoal.\n\n\nNote: When entering a regular expression as a parameter in the\nXML config file you must also take into account the XML rules. e.g. if\nyou want to match a < symbol you need to enter &lt;. The regular\nexpression should be entered on one line.", "option": "\nduplicateLimit, Control whether to check for duplicates of a required pattern, any negative value means no checking for duplicates, any positive value is used as the maximum number of allowed duplicates, if the limit is exceeded violations will be logged., int, 0\nerrorLimit, Specify the maximum number of violations before the check will abort., int, 100\nformat, Specify the pattern to match against., Pattern, \"^$\"\nignoreComments, Control whether to ignore matches found within comments., boolean, false\nillegalPattern, Control whether the pattern is required or illegal., boolean, false\nmessage, Specify message which is used to notify about violations, if empty then the default (hard-coded) message is used., String, null"}}