{"RegexpOnFilename": {"description": "Description\n\nChecks that a specified pattern matches based on file and/or folder path.\nIt can also be used to verify files match specific naming\npatterns not covered by other checks (Ex: properties, xml, etc.).\n\n\nWhen customizing the check, the properties are applied in a specific order.\nThe fileExtensions property first picks only files that match any of the\nspecific extensions supplied.\nOnce files are matched against the fileExtensions, the match property is then\nused in conjunction with the patterns to determine if the check is looking\nfor a match or mismatch on those files. If the fileNamePattern is\nsupplied, the matching is only applied to the fileNamePattern and not the\nfolderPattern. If no fileNamePattern is supplied, then matching is applied\nto the folderPattern only and will result in all files in a folder to be\nreported on violations. If no folderPattern is supplied, then all folders\nthat checkstyle finds are examined for violations.\nThe ignoreFileNameExtensions property drops the file extension and applies\nthe fileNamePattern only to the rest of file name. For example, if the file is\nnamed 'test.java' and this property is turned on, the pattern is only applied\nto 'test'.\n\n\nIf this check is configured with no properties, then the default behavior\nof this check is to report file names with spaces in them.\nWhen at least one pattern property is supplied, the entire check is under\nthe user's control to allow them to fully customize the behavior.\n\n\nIt is recommended that if you create your own pattern, to also\nspecify a custom violation message. This allows the violation message printed\nto be clear what the violation is, especially if multiple RegexpOnFilename\nchecks are used.\nArgument 0 for the message populates the check's folderPattern.\nArgument 1 for the message populates the check's fileNamePattern.\nThe file name is not passed as an argument since it is part of CheckStyle's\ndefault violation messages.", "option": "\nfileExtensions, Specify the file extensions of the files to process., String[], all files\nfileNamePattern, Specify the regular expression to match the file name against., Pattern, null\nfolderPattern, Specify the regular expression to match the folder path against., Pattern, null\nignoreFileNameExtensions, Control whether to ignore the file extension for the file name match., boolean, false\nmatch, Control whether to look for a match or mismatch on the file name, if the fileNamePattern is supplied, otherwise it is applied on the folderPattern., boolean, true"}}