{"rule_name": {"description": "Description\n\nChecks the header of a source file against a header that contains a\n\npattern for each line of the source header.\n\n\nRationale: In some projects checking against a\nfixed header is not sufficient, e.g. the header might require a\ncopyright line where the year information is not static.\n\n\nFor example, consider the following header:\n\n\n\nline  1: ^/{71}$\nline  2: ^// checkstyle:$\nline  3: ^// Checks Java source code for adherence to a set of rules\\.$\nline  4: ^// Copyright \\(C\\) \\d\\d\\d\\d  Oliver Burn$\nline  5: ^// Last modification by \\$Author.*\\$$\nline  6: ^/{71}$\nline  7:\nline  8: ^package\nline  9:\nline 10: ^import\nline 11:\nline 12: ^/\\*\\*\nline 13: ^ \\*([^/]|$)\nline 14: ^ \\*/\n\n\nLines 1 and 6 demonstrate a more compact notation for 71 '/'\ncharacters. Line 4 enforces that the copyright notice includes a\nfour digit year. Line 5 is an example how to enforce revision\ncontrol keywords in a file header. Lines 12-14 is a template for\njavadoc (line 13 is so complicated to remove conflict with and of\njavadoc comment). Lines 7, 9 and 11 will be treated as '^$' and\nwill forcefully expect the line to be empty.\n\n\nDifferent programming languages have different comment syntax\nrules, but all of them start a comment with a non-word\ncharacter. Hence, you can often use the non-word character\nclass to abstract away the concrete comment syntax and allow\nchecking the header for different languages with a single\nheader definition. For example, consider the following header\nspecification (note that this is not the full Apache license\nheader):\n\n\n\nline 1: ^#!\nline 2: ^<\\?xml.*>$\nline 3: ^\\W*$\nline 4: ^\\W*Copyright 2006 The Apache Software Foundation or its licensors, as applicable\\.$\nline 5: ^\\W*Licensed under the Apache License, Version 2\\.0 \\(the \"License\"\\);$\nline 6: ^\\W*$\n\n\nLines 1 and 2 leave room for technical header lines, e.g. the\n\"#!/bin/sh\" line in Unix shell scripts, or the XML file header\nof XML files. Set the multiline property to \"1, 2\" so these\nlines can be ignored for file types where they do no apply.\nLines 3 through 6 define the actual header content. Note how\nlines 2, 4 and 5 use escapes for characters that have special\nregexp semantics.\n\n\nIn default configuration, if header is not specified, the default value\nof header is set to null and the check does not rise any violations.", "option": "\ncharset, Specify the character encoding to use when reading the headerFile., String, the charset property of the parent <a href=\"https://checkstyle.org/config.html#Checker\">Checker</a> module\nfileExtensions, Specify the file extensions of the files to process., String[], all files\nheader, Define the required header specified inline. Individual header lines must be separated by the string \"\\n\" (even on platforms with a different line separator). For header lines containing \"\\n\\n\" checkstyle will forcefully expect an empty line to exist. See examples below. Regular expressions must not span multiple lines., String, null\nheaderFile, Specify the name of the file containing the required header., URI, null\nmultiLines, Specify the line numbers to repeat (zero or more times)., int[], {}"}}