{"VisibilityModifier": {"description": "Description\n\nChecks visibility of class members. Only static final, immutable or annotated\nby specified annotation members may be public; other class members must be private\nunless the property protectedAllowed or packageAllowed is set.\n\n\nPublic members are not flagged if the name matches the public\nmember regular expression (contains \"^serialVersionUID$\" by default).\n\nNote that\nCheckstyle 2 used to include \"^f[A-Z][a-zA-Z0-9]*$\" in the default\npattern to allow names used in container-managed persistence for Enterprise JavaBeans\n(EJB) 1.1 with the default settings. With EJB 2.0 it is no longer necessary to have\npublic access for persistent fields, so the default has been changed.\n\n\nRationale: Enforce encapsulation.\n\n\nCheck also has options making it less strict:\n\n\nignoreAnnotationCanonicalNames - the list of annotations which ignore variables\nin consideration. If user want to provide short annotation name that type\nwill match to any named the same type without consideration of package.\n\n\nallowPublicFinalFields - which allows public final fields.\n\n\nallowPublicImmutableFields - which allows immutable fields to be declared as\npublic if defined in final class.\n\n\nField is known to be immutable if:\n\n\nIt's declared as final\n\nHas either a primitive type or instance of class user defined to be immutable\n(such as String, ImmutableCollection from Guava, etc.)\n\n\n\nClasses known to be immutable are listed in immutableClassCanonicalNames by their\ncanonical names.\n\n\nProperty Rationale: Forcing all fields of class to have private modifier by default is\ngood in most cases, but in some cases it drawbacks in too much boilerplate get/set code.\nOne of such cases are immutable classes.\n\n\nRestriction: Check doesn't check if class is immutable, there's no\nchecking if accessory methods are missing and all fields are immutable, we only check\nif current field is immutable or final. Under the flag\nallowPublicImmutableFields, the enclosing class must also be final, to encourage\nimmutability. Under the flag allowPublicFinalFields, the final modifier on\nthe enclosing class is optional.\n\n\nStar imports are out of scope of this Check. So if one of type imported via\nstar import collides with user specified one by its short name -\nthere won't be Check's violation.", "option": "\nallowPublicFinalFields, Allow final fields to be declared as public., boolean, false\nallowPublicImmutableFields, Allow immutable fields to be declared as public if defined in final class., boolean, false\nignoreAnnotationCanonicalNames, Specify annotations canonical names which ignore variables in consideration., String[], com.google.common.annotations.VisibleForTesting, org.junit.ClassRule, org.junit.Rule\nimmutableClassCanonicalNames, Specify immutable classes canonical names., String[], java.io.File, java.lang.Boolean, java.lang.Byte, java.lang.Character, java.lang.Double, java.lang.Float, java.lang.Integer, java.lang.Long, java.lang.Short, java.lang.StackTraceElement, java.lang.String, java.math.BigDecimal, java.math.BigInteger, java.net.Inet4Address, java.net.Inet6Address, java.net.InetSocketAddress, java.net.URI, java.net.URL, java.util.Locale, java.util.UUID\npackageAllowed, Control whether package visible members are allowed., boolean, false\nprotectedAllowed, Control whether protected members are allowed., boolean, false\npublicMemberPattern, Specify pattern for public members that should be ignored., Pattern, \"^serialVersionUID$\""}}