{"rule_name": {"description": "Description\n\nControls what can be imported in each package and file. Useful for\nensuring that application layering rules are not violated,\nespecially on large projects.\n\n\nYou can control imports based on the package name or based on the file\nname. When controlling packages, all files and sub-packages in the declared\npackage will be controlled by this check. To specify differences between a main package\nand a sub-package, you must define the sub-package inside the main package. When\ncontrolling file, only the file name is considered and only files processed by\nTreeWalker. The file's extension is ignored.\n\n\nShort description of the behaviour:\n\n\nCheck starts checking from the longest matching subpackage (later 'current\nsubpackage') or the first file name match described inside import\ncontrol file to package defined in class file.\n\n\n\nThe longest matching subpackage is found by starting with the root package\nand examining if any of the sub-packages or file definitions match the\ncurrent class' package or file name.\n\n\nIf a file name is matched first, that is considered the longest\nmatch and becomes the current file/subpackage.\n\n\nIf another subpackage is matched, then it's subpackages and file\nnames are examined for the next longest match and the process repeats\nrecursively.\n\n\nIf no subpackages or file names are matched, the current subpackage\nis then used.\n\n\n\n\nOrder of rules in the same subpackage/root are defined by the order of\ndeclaration in the XML file, which is from top (first) to bottom (last).\n\n\nIf there is matching allow/disallow rule inside the current file/subpackage\nthen the Check returns the first \"allowed\" or \"disallowed\" message.\n\n\nIf there is no matching allow/disallow rule inside the current file/subpackage\nthen it continues checking in the parent subpackage.\n\n\nIf there is no matching allow/disallow rule in any of the files/subpackages,\nincluding the root level (import-control), then the import is disallowed by default.\n\n\n\nThe DTD for an import control XML document is at\nhttps://checkstyle.org/dtds/import_control_1_4.dtd. It\ncontains documentation on each of the elements and attributes.\n\n\nThe check validates a XML document when it loads the document.\nTo validate against the above DTD, include the following\ndocument type declaration in your XML document:\n\n\n\n\n<!DOCTYPE import-control PUBLIC\n\"-//Checkstyle//DTD ImportControl Configuration 1.4//EN\"\n\"https://checkstyle.org/dtds/import_control_1_4.dtd\">", "option": "\nfile, Specify the location of the file containing the import control configuration. It can be a regular file, URL or resource path. It will try loading the path as a URL first, then as a file, and finally as a resource., URI, null\npath, Specify the regular expression of file paths to which this check should apply. Files that don't match the pattern will not be checked. The pattern will be matched against the full absolute file path., Pattern, \".*\""}}