{"rule_name": {"description": "Description\n\nChecks the number of methods declared in each type declaration by access modifier or\ntotal count.\n\n\nThis check can be configured to flag classes that define too many methods to prevent the\nclass from getting too complex.\nCounting can be customized to prevent too many total methods in a type definition\n(maxTotal), or to prevent too many methods of a specific access modifier\n(private, package, protected or\npublic).\nEach count is completely separated to customize how many methods of each you want to\nallow. For example, specifying a maxTotal of 10, still means you can\nprevent more than 0 maxPackage methods. A violation won't appear for 8\npublic methods, but one will appear if there is also 3 private methods or any\npackage-private methods.\n\n\nMethods defined in anonymous classes are not counted towards any totals.\nCounts only go towards the main type declaration parent, and are kept separate from it's\nchildren's inner types.\n\n\n\npublic class ExampleClass {\npublic enum Colors {\nRED, GREEN, YELLOW;\n\npublic String getRGB() { ... } // NOT counted towards ExampleClass\n}\n\npublic void example() { // counted towards ExampleClass\nRunnable r = (new Runnable() {\npublic void run() { ... } // NOT counted towards ExampleClass, won't produce any violations\n});\n}\n\npublic static class InnerExampleClass {\nprotected void example2() { ... } // NOT counted towards ExampleClass,\n// but counted towards InnerExampleClass\n}\n}", "option": "\nmaxPackage, Specify the maximum number of package methods allowed., int, 100\nmaxPrivate, Specify the maximum number of private methods allowed., int, 100\nmaxProtected, Specify the maximum number of protected methods allowed., int, 100\nmaxPublic, Specify the maximum number of public methods allowed., int, 100\nmaxTotal, Specify the maximum number of methods allowed at all scope levels., int, 100\ntokens, tokens to check, subset of tokens\n\nCLASS_DEF\n,\nENUM_CONSTANT_DEF\n,\nENUM_DEF\n,\nINTERFACE_DEF\n,\nANNOTATION_DEF\n,\nRECORD_DEF\n.\n,\n\nCLASS_DEF\n,\nENUM_CONSTANT_DEF\n,\nENUM_DEF\n,\nINTERFACE_DEF\n,\nANNOTATION_DEF\n,\nRECORD_DEF\n.\n"}}