{"rule_name": {"description": "Description\n\nThe check to ensure that lines with code do not end with comment.\nFor the case of // comments that means that the only thing\nthat should precede it is whitespace. It doesn't check comments if\nthey do not end a line; for example, it accepts the following:\nThread.sleep( 10 /*some comment here*/ ); Format\nproperty is intended to deal with the } // while example.\n\n\nRationale: Steve McConnell in Code Complete suggests that\nendline comments are a bad practice. An end line comment would be\none that is on the same line as actual code. For example:\n\n\n\na = b + c;      // Some insightful comment\nd = e / f;        // Another comment for this line\n\n\nQuoting Code Complete for the justification:\n\n\n\"The comments have to be aligned so that they do not\ninterfere with the visual structure of the code. If you don't align\nthem neatly, they'll make your listing look like it's been through a\nwashing machine.\"\n\n\"Endline comments tend to be hard to format...It takes\ntime to align them. Such time is not spent learning more about the\ncode; it's dedicated solely to the tedious task of pressing the\nspacebar or tab key.\"\n\n\"Endline comments are also hard to maintain. If the code\non any line containing an endline comment grows, it bumps the\ncomment farther out, and all the other endline comments will have to\nbumped out to match. Styles that are hard to maintain aren't\nmaintained....\"\n\n\"Endline comments also tend to be cryptic. The right side\nof the line doesn't offer much room and the desire to keep the\ncomment on one line means the comment must be short. Work then goes\ninto making the line as short as possible instead of as clear as\npossible. The comment usually ends up as cryptic as\npossible....\"\n\n\"A systemic problem with endline comments is that it's\nhard to write a meaningful comment for one line of code. Most\nendline comments just repeat the line of code, which hurts more than\nit helps.\"\n\n\n\nMcConnell's comments on being hard to maintain when the size of the line\nchanges are even more important in the age of automated\nrefactorings.", "option": "\nformat, Specify pattern for strings allowed before the comment., Pattern, \"^[\\s});]*$\"\nlegalComment, Define pattern for text allowed in trailing comments. This pattern will not be applied to multiline comments., Pattern, null"}}