{
  "name": "consistent-return",
  "meta": {
    "description": "Require return statements to either always or never specify values",
    "url": "https://eslint.org/docs/latest/rules/consistent-return",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Requirereturnstatements to either always or never specify values\nTable of ContentsRule DetailsOptionstreatUndefinedAsUnspecifiedWhen Not To Use ItVersionResources\nUnlike statically-typed languages which enforce that a function returns a specified type of value, JavaScript allows different code paths in a function to return different types of values.\nA confusing aspect of JavaScript is that a function returnsundefinedif any of the following are true:\nIt does not execute areturnstatement before it exits.It executesreturnwhich does not specify a value explicitly.It executesreturn undefined.It executesreturn voidfollowed by an expression (for example, a function call).It executesreturnfollowed by any other expression which evaluates toundefined.\nIf any code paths in a function return a value explicitly but some code path do not return a value explicitly, it might be a typing mistake, especially in a large function. In the following example:\nA code path through the function returns a Boolean valuetrue.Another code path does not return a value explicitly, therefore returnsundefinedimplicitly.\nfunctiondoSomething(condition){if(condition){returntrue;}else{return;}}1234567Copy code to clipboard",
    "sub_configuration_introduction": "This rule has an object option:\n\"treatUndefinedAsUnspecified\": false(default) always either specify values or returnundefinedimplicitly only.\"treatUndefinedAsUnspecified\": truealways either specify values or returnundefinedexplicitly or implicitly.\nExamples ofincorrectcode for this rule with the default{ \"treatUndefinedAsUnspecified\": false }option:\nExamples ofincorrectcode for this rule with the{ \"treatUndefinedAsUnspecified\": true }option:\nExamples ofcorrectcode for this rule with the{ \"treatUndefinedAsUnspecified\": true }option:",
    "config_examples": []
  }
}