{
  "name": "dot-notation",
  "meta": {
    "description": "Enforce dot notation whenever possible",
    "url": "https://eslint.org/docs/latest/rules/dot-notation",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": true
    },
    "capabilities": {
      "recommended": false,
      "fixable": true,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Enforce dot notation whenever possible\n🔧FixableSome problems reported by this rule are automatically fixable by the--fixcommand lineoption❄️FrozenThis rule is currentlyfrozenand is not accepting feature requests.\nTable of ContentsRule DetailsOptionsallowKeywordsallowPatternVersionResources\nIn JavaScript, one can access properties using the dot notation (foo.bar) or square-bracket notation (foo[\"bar\"]). However, the dot notation is often preferred because it is easier to read, less verbose, and works better with aggressive JavaScript minimizers.\nfoo[\"bar\"];1Copy code to clipboard",
    "sub_configuration_introduction": "This rule accepts a single options argument:\nSet theallowKeywordsoption tofalse(default istrue) to follow ECMAScript version 3 compatible style, avoiding dot notation for reserved word properties.Set theallowPatternoption to a regular expression string to allow bracket notation for property names that match a pattern (by default, no pattern is tested).\nExamples ofcorrectcode for the{ \"allowKeywords\": false }option:\nExamples of additionalcorrectcode for the{ \"allowKeywords\": false }option:\nFor example, when preparing data to be sent to an external API, it is often required to use property names that include underscores.  If thecamelcaserule is in effect, thesesnake caseproperties would not be allowed.  By providing anallowPatternto thedot-notationrule, these snake case properties can be accessed with bracket notation.\nExamples ofincorrectcode for the sample{ \"allowPattern\": \"^[a-z]+(_[a-z]+)+$\" }(pattern to find snake case named properties) option:\nExamples ofcorrectcode for the sample{ \"allowPattern\": \"^[a-z]+(_[a-z]+)+$\" }(pattern to find snake case named properties) option:",
    "config_examples": []
  }
}