{
  "name": "id-match",
  "meta": {
    "description": "Require identifiers to match a specified regular expression",
    "url": "https://eslint.org/docs/latest/rules/id-match",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": true
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Require identifiers to match a specified regular expression\n❄️FrozenThis rule is currentlyfrozenand is not accepting feature requests.\nTable of ContentsRule DetailsOptionspropertiesclassFieldsonlyDeclarationsignoreDestructuring: falseignoreDestructuring: trueWhen Not To Use ItVersionResources\n“There are only two hard things in Computer Science: cache invalidation and naming things.” — Phil Karlton\nNaming things consistently in a project is an often underestimated aspect of code creation.\nWhen done correctly, it can save your team hours of unnecessary head scratching and misdirections.\nThis rule allows you to precisely define and enforce the variables and function names on your team should use.\nNo more limiting yourself to camelCase, snake_case, PascalCase, or HungarianNotation.id-matchhas all your needs covered!",
    "sub_configuration_introduction": "This rule has a string option for the specified regular expression.\nFor example, to enforce a camelcase naming convention:\nExamples ofincorrectcode for this rule with the\"^[a-z]+([A-Z][a-z]+)*$\"option:\nExamples ofcorrectcode for this rule with the\"^[a-z]+([A-Z][a-z]+)*$\"option:\nThis rule has an object option:\n\"properties\": false(default) does not check object properties\"properties\": truerequires object literal properties and member expression assignment properties to match the specified regular expression\"classFields\": false(default) does not check class field names\"classFields\": truerequires class field names to match the specified regular expression\"onlyDeclarations\": false(default) requires all variable names to match the specified regular expression\"onlyDeclarations\": truerequires onlyvar,const,let,function, andclassdeclarations to match the specified regular expression\"ignoreDestructuring\": false(default) enforcesid-matchfor destructured identifiers\"ignoreDestructuring\": truedoes not check destructured identifiers\nExamples ofincorrectcode for this rule with the\"^[a-z]+([A-Z][a-z]+)*$\", { \"properties\": true }options:\nExamples ofincorrectcode for this rule with the\"^[a-z]+([A-Z][a-z]+)*$\", { \"classFields\": true }options:\nExamples ofcorrectcode for this rule with the\"^[a-z]+([A-Z][a-z]+)*$\", { \"onlyDeclarations\": true }options:\nExamples ofincorrectcode for this rule with the default\"^[^_]+$\", { \"ignoreDestructuring\": false }option:\nExamples ofincorrectcode for this rule with the\"^[^_]+$\", { \"ignoreDestructuring\": true }option:\nExamples ofcorrectcode for this rule with the\"^[^_]+$\", { \"ignoreDestructuring\": true }option:",
    "config_examples": []
  }
}