{
  "name": "init-declarations",
  "meta": {
    "description": "Require or disallow initialization in variable declarations",
    "url": "https://eslint.org/docs/latest/rules/init-declarations",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": true
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Require or disallow initialization in variable declarations\n❄️FrozenThis rule is currentlyfrozenand is not accepting feature requests.\nTable of ContentsRule DetailsOptionsalwaysneverignoreForLoopInitWhen Not To Use ItRelated RulesVersionResources\nIn JavaScript, variables can be assigned during declaration, or at any point afterwards using an assignment statement. For example, in the following code,foois initialized during declaration, whilebaris initialized later.\nletfoo=1;letbar;if(foo){bar=1;}else{bar=2;}12345678Copy code to clipboard",
    "sub_configuration_introduction": "The rule takes two options:\nA string which must be either\"always\"(the default), to enforce initialization at declaration, or\"never\"to disallow initialization during declaration. This rule applies tovar,let,const,using, andawait usingvariables, however\"never\"is ignored forconst,using, andawait usingvariables, as not initializing these variables would generate a parse error.An object that further controls the behavior of this rule. Currently, the only available parameter isignoreForLoopInit, which indicates if initialization at declaration is allowed inforloops when\"never\"is set, since it is a very typical use case.\nYou can configure the rule as follows:\nVariables must be initialized at declaration (default)\nVariables must not be initialized at declaration\nVariables must not be initialized at declaration, except in for loops, where it is allowed\nExamples ofincorrectcode for the default\"always\"option:\nExamples ofcorrectcode for the default\"always\"option:\nExamples ofincorrectcode for the\"never\"option:\nExamples ofcorrectcode for the\"never\"option:\nThe\"never\"option ignoresconst,using, andawait usingvariable initializations.\nExamples ofcorrectcode for the\"never\", { \"ignoreForLoopInit\": true }options:\nThis rule additionally supports TypeScript type syntax.\nExamples ofincorrectTypeScript code for this rule:\nExamples ofcorrectTypeScript code for this rule:",
    "config_examples": []
  }
}