{
  "name": "max-lines-per-function",
  "meta": {
    "description": "Enforce a maximum number of lines of code in a function",
    "url": "https://eslint.org/docs/latest/rules/max-lines-per-function",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Enforce a maximum number of lines of code in a function\nTable of ContentsRule DetailsWhy not use max-statements or other complexity measurement rules instead?OptionscodeskipBlankLinesskipCommentsIIFEsWhen Not To Use ItRelated RulesVersionResources\nSome people consider large functions a code smell. Large functions tend to do a lot of things and can make it hard following what’s going on. Many coding style guides dictate a limit of the number of lines that a function can comprise of. This rule can help enforce that style.",
    "sub_configuration_introduction": "This rule has the following options that can be specified using an object:\n\"max\"(default50) enforces a maximum number of lines in a function.\"skipBlankLines\"(defaultfalse) ignore lines made up purely of whitespace.\"skipComments\"(defaultfalse) ignore lines containing just comments.\"IIFEs\"(defaultfalse) include any code included in IIFEs.\nAlternatively, you may specify a single integer for themaxoption:\nis equivalent to\nExamples ofincorrectcode for this rule with a particular max value:\nExamples ofcorrectcode for this rule with a particular max value:\nExamples ofincorrectcode for this rule with the{ \"skipBlankLines\": true }option:\nExamples ofcorrectcode for this rule with the{ \"skipBlankLines\": true }option:\nExamples ofincorrectcode for this rule with the{ \"skipComments\": true }option:\nExamples ofcorrectcode for this rule with the{ \"skipComments\": true }option:\nExamples ofincorrectcode for this rule with the{ \"IIFEs\": true }option:\nExamples ofcorrectcode for this rule with the{ \"IIFEs\": true }option:",
    "config_examples": []
  }
}