{
  "name": "no-fallthrough",
  "meta": {
    "description": "Disallow fallthrough of case statements",
    "url": "https://eslint.org/docs/latest/rules/no-fallthrough",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": true,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Disallow fallthrough ofcasestatements\n✅RecommendedUsing therecommendedconfig from@eslint/jsin aconfiguration fileenables this rule\nTable of ContentsRule DetailsOptionscommentPatternallowEmptyCasereportUnusedFallthroughCommentWhen Not To Use ItRelated RulesVersionResources\nTheswitchstatement in JavaScript is one of the more error-prone constructs of the language thanks in part to the ability to “fall through” from onecaseto the next. For example:\nswitch(foo){case1:doSomething();case2:doSomethingElse();}1234567Copy code to clipboard\nIn this example, iffoois1, then execution will flow through both cases, as the first falls through to the second. You can prevent this by usingbreak, as in this example:\nswitch(foo){case1:doSomething();break;case2:doSomethingElse();}12345678Copy code to clipboard\nThat works fine when you don’t want a fallthrough, but what if the fallthrough is intentional, there is no way to indicate that in the language. It’s considered a best practice to always indicate when a fallthrough is intentional using a comment which matches the/falls?\\s?through/iregular expression but isn’t a directive:\nswitch(foo){case1:doSomething();// falls throughcase2:doSomethingElse();}switch(foo){case1:doSomething();// fall throughcase2:doSomethingElse();}switch(foo){case1:doSomething();// fallsthroughcase2:doSomethingElse();}switch(foo){case1:{doSomething();// falls through}case2:{doSomethingElse();}}12345678910111213141516171819202122232425262728293031323334353637Copy code to clipboard\nIn this example, there is no confusion as to the expected behavior. It is clear that the first case is meant to fall through to the second case.",
    "sub_configuration_introduction": "This rule has an object option:\nSet thecommentPatternoption to a regular expression string to change the test for intentional fallthrough comment. If the fallthrough comment matches a directive, that takes precedence overcommentPattern.Set theallowEmptyCaseoption totrueto allow empty cases regardless of the layout. By default, this rule does not require a fallthrough comment after an emptycaseonly if the emptycaseand the nextcaseare on the same line or on consecutive lines.Set thereportUnusedFallthroughCommentoption totrueto prohibit a fallthrough comment from being present if the case cannot fallthrough due to being unreachable. This is mostly intended to help avoid misleading comments occurring as a result of refactoring.\nExamples ofcorrectcode for the{ \"commentPattern\": \"break[\\\\s\\\\w]*omitted\" }option:\nExamples ofcorrectcode for the{ \"allowEmptyCase\": true }option:\nExamples ofincorrectcode for the{ \"reportUnusedFallthroughComment\": true }option:\nExamples ofcorrectcode for the{ \"reportUnusedFallthroughComment\": true }option:",
    "config_examples": []
  }
}