{
  "name": "no-labels",
  "meta": {
    "description": "Disallow labeled statements",
    "url": "https://eslint.org/docs/latest/rules/no-labels",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": true
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Disallow labeled statements\n❄️FrozenThis rule is currentlyfrozenand is not accepting feature requests.\nTable of ContentsRule DetailsOptionsallowLoopallowSwitchWhen Not To Use ItRelated RulesVersionResources\nLabeled statements in JavaScript are used in conjunction withbreakandcontinueto control flow around multiple loops. For example:\nouter:while(true){while(true){breakouter;}}1234567Copy code to clipboard\nThebreak outerstatement ensures that this code will not result in an infinite loop because control is returned to the next statement after theouterlabel was applied. If this statement was changed to be justbreak, control would flow back to the outerwhilestatement and an infinite loop would result.\nWhile convenient in some cases, labels tend to be used only rarely and are frowned upon by some as a remedial form of flow control that is more error prone and harder to understand.",
    "sub_configuration_introduction": "The options allow labels with loop or switch statements:\n\"allowLoop\"(boolean, default isfalse) - If this option was settrue, this rule ignores labels which are sticking to loop statements.\"allowSwitch\"(boolean, default isfalse) - If this option was settrue, this rule ignores labels which are sticking to switch statements.\nActually labeled statements in JavaScript can be used with other than loop and switch statements.\nHowever, this way is ultra rare, not well-known, so this would be confusing developers.\nExamples ofcorrectcode for the{ \"allowLoop\": true }option:\nExamples ofcorrectcode for the{ \"allowSwitch\": true }option:",
    "config_examples": []
  }
}