{
  "name": "no-restricted-syntax",
  "meta": {
    "description": "Disallow specified syntax",
    "url": "https://eslint.org/docs/latest/rules/no-restricted-syntax",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Disallow specified syntax\nTable of ContentsRule DetailsOptionsWhen Not To Use ItRelated RulesVersionResources\nJavaScript has a lot of language features, and not everyone likes all of them. As a result, some projects choose to disallow the use of certain language features altogether. For instance, you might decide to disallow the use oftry-catchorclass, or you might decide to disallow the use of theinoperator.\nRather than creating separate rules for every language feature you want to turn off, this rule allows you to configure the syntax elements you want to restrict use of. For the JavaScript language, these elements are represented by theirESTreenode types. For example, a function declaration is represented byFunctionDeclarationand thewithstatement is represented byWithStatement. You may useCode Explorerto determine the nodes that represent your code.\nYou can also specifyAST selectorsto restrict, allowing much more precise control over syntax patterns.\nNote: This rule can be used with any language you lint using ESLint. To see what type of nodes your code in another language consists of, you can use:\ntypescript-eslint Playgroundif you’re using ESLint withtypescript-eslint.ESLint Code Explorerif you’re using ESLint to lint JavaScript, JSON, Markdown, or CSS.",
    "sub_configuration_introduction": "This rule takes a list of strings, where each string is an AST selector:\nAlternatively, the rule also accepts objects, where the selector and an optional custom message are specified:\nIf a custom message is specified with themessageproperty, ESLint will use that message when reporting occurrences of the syntax specified in theselectorproperty.\nThe string and object formats can be freely mixed in the configuration as needed.\nExamples ofincorrectcode for this rule with the\"FunctionExpression\", \"WithStatement\", BinaryExpression[operator='in']options:\nExamples ofcorrectcode for this rule with the\"FunctionExpression\", \"WithStatement\", BinaryExpression[operator='in']options:",
    "config_examples": []
  }
}