{
  "name": "no-underscore-dangle",
  "meta": {
    "description": "Disallow dangling underscores in identifiers",
    "url": "https://eslint.org/docs/latest/rules/no-underscore-dangle",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": true
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Disallow dangling underscores in identifiers\n❄️FrozenThis rule is currentlyfrozenand is not accepting feature requests.\nTable of ContentsRule DetailsOptionsallowallowAfterThisallowAfterSuperallowAfterThisConstructorenforceInMethodNamesenforceInClassFieldsallowInArrayDestructuringallowInObjectDestructuringallowFunctionParamsWhen Not To Use ItVersionResources\nAs far as naming conventions for identifiers go, dangling underscores may be the most polarizing in JavaScript. Dangling underscores are underscores at either the beginning or end of an identifier, such as:\nlet_foo;1Copy code to clipboard\nThere is a long history of marking “private” members with dangling underscores in JavaScript, beginning with SpiderMonkey adding nonstandard methods such as__defineGetter__(). Since that time, using a single underscore prefix has become the most popular convention for indicating a member is not part of the public interface of an object.\nIt is recommended to use the formalprivate class featuresintroduced in ECMAScript 2022 for encapsulating private data and methods rather than relying on naming conventions.\nAllowing dangling underscores in identifiers is purely a convention and has no effect on performance, readability, or complexity. They do not have the same encapsulation benefits as private class features, even with this rule enabled.",
    "sub_configuration_introduction": "This rule has an object option:\n\"allow\"allows specified identifiers to have dangling underscores\"allowAfterThis\": false(default) disallows dangling underscores in members of thethisobject\"allowAfterSuper\": false(default) disallows dangling underscores in members of thesuperobject\"allowAfterThisConstructor\": false(default) disallows dangling underscores in members of thethis.constructorobject\"enforceInMethodNames\": false(default) allows dangling underscores in method names\"enforceInClassFields\": false(default) allows dangling underscores in es2022 class fields names\"allowInArrayDestructuring\": true(default) allows dangling underscores in variable names assigned by array destructuring\"allowInObjectDestructuring\": true(default) allows dangling underscores in variable names assigned by object destructuring\"allowFunctionParams\": true(default) allows dangling underscores in function parameter names\nExamples of additionalcorrectcode for this rule with the{ \"allow\": [\"foo_\", \"_bar\"] }option:\nExamples ofcorrectcode for this rule with the{ \"allowAfterThis\": true }option:\nExamples ofcorrectcode for this rule with the{ \"allowAfterSuper\": true }option:\nExamples ofcorrectcode for this rule with the{ \"allowAfterThisConstructor\": true }option:\nExamples ofincorrectcode for this rule with the{ \"enforceInMethodNames\": true }option:\nExamples ofincorrectcode for this rule with the{ \"enforceInClassFields\": true }option:\nExamples ofincorrectcode for this rule with the{ \"allowInArrayDestructuring\": false }option:\nExamples ofincorrectcode for this rule with the{ \"allowInObjectDestructuring\": false }option:\nExamples ofcorrectcode for this rule with the{ \"allowInObjectDestructuring\": false }option:\nExamples ofincorrectcode for this rule with the{ \"allowFunctionParams\": false }option:",
    "config_examples": []
  }
}