{
  "name": "no-unused-vars",
  "meta": {
    "description": "Disallow unused variables",
    "url": "https://eslint.org/docs/latest/rules/no-unused-vars",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": true,
      "fixable": false,
      "has_suggestions": true
    }
  },
  "content": {
    "introduction": "Disallow unused variables\n✅RecommendedUsing therecommendedconfig from@eslint/jsin aconfiguration fileenables this rule💡hasSuggestionsSome problems reported by this rule are manually fixable by editorsuggestions\nTable of ContentsRule DetailsexportedOptionsvarsvars: localvarsIgnorePatternargsargs: after-usedargs: allargs: noneargsIgnorePatterncaughtErrorscaughtErrors: allcaughtErrors: nonecaughtErrorsIgnorePatterndestructuredArrayIgnorePatternignoreRestSiblingsignoreClassWithStaticInitBlockignoreUsingDeclarationsreportUsedIgnorePatternWhen Not To Use ItRelated RulesVersionResources\nVariables that are declared and not used anywhere in the code are most likely an error due to incomplete refactoring. Such variables take up space in the code and can lead to confusion by readers.",
    "sub_configuration_introduction": "This rule takes one argument which can be a string or an object. The string settings are the same as those of thevarsproperty (explained below).\nBy default this rule is enabled withalloption for caught errors and variables, andafter-usedfor arguments.\nThevarsoption has two settings:\nallchecks all variables for usage, including those in the global scope. However, it excludes variables targeted by other options likeargsandcaughtErrors. This is the default setting.localchecks only that locally-declared variables are used but will allow global variables to be unused.\nExamples ofcorrectcode for the{ \"vars\": \"local\" }option:\nThevarsIgnorePatternoption specifies exceptions not to check for usage: variables whose names match a regexp pattern. For example, variables whose names containignoredorIgnored. However, it excludes variables targeted by other options likeargsIgnorePatternandcaughtErrorsIgnorePattern.\nExamples ofcorrectcode for the{ \"varsIgnorePattern\": \"[iI]gnored\" }option:\nTheargsoption has three settings:\nafter-used- unused positional arguments that occur before the last used argument will not be checked, but all named arguments and all positional arguments after the last used argument will be checked.all- all named arguments must be used.none- do not check arguments.\nExamples ofincorrectcode for the default{ \"args\": \"after-used\" }option:\nExamples ofcorrectcode for the default{ \"args\": \"after-used\" }option:\nExamples ofincorrectcode for the{ \"args\": \"all\" }option:\nExamples ofcorrectcode for the{ \"args\": \"none\" }option:\nTheargsIgnorePatternoption specifies exceptions not to check for usage: arguments whose names match a regexp pattern. For example, variables whose names begin with an underscore.\nExamples ofcorrectcode for the{ \"argsIgnorePattern\": \"^_\" }option:\nThecaughtErrorsoption is used forcatchblock arguments validation.\nIt has two settings:\nall- all named arguments must be used. This is the default setting.none- do not check error objects.\nNot specifying this option is equivalent of assigning it toall.\nExamples ofincorrectcode for the{ \"caughtErrors\": \"all\" }option:\nExamples ofcorrectcode for the{ \"caughtErrors\": \"none\" }option:\nThecaughtErrorsIgnorePatternoption specifies exceptions not to check for usage: catch arguments whose names match a regexp pattern. For example, variables whose names begin with a string ‘ignore’.\nExamples ofcorrectcode for the{ \"caughtErrorsIgnorePattern\": \"^ignore\" }option:\nThedestructuredArrayIgnorePatternoption specifies exceptions not to check for usage: elements of array destructuring patterns whose names match a regexp pattern. For example, variables whose names begin with an underscore.\nExamples ofcorrectcode for the{ \"destructuredArrayIgnorePattern\": \"^_\" }option:\nTheignoreRestSiblingsoption is a boolean (default:false). Using aRest Propertyit is possible to “omit” properties from an object, but by default the sibling properties are marked as “unused”. With this option enabled the rest property’s siblings are ignored.\nExamples ofcorrectcode for the{ \"ignoreRestSiblings\": true }option:\nTheignoreClassWithStaticInitBlockoption is a boolean (default:false). Static initialization blocks allow you to initialize static variables and execute code during the evaluation of a class definition, meaning the static block code is executed without creating a new instance of the class. When set totrue, this option ignores classes containing static initialization blocks.\nExamples ofincorrectcode for the{ \"ignoreClassWithStaticInitBlock\": true }option\nExamples ofcorrectcode for the{ \"ignoreClassWithStaticInitBlock\": true }option\nTheignoreUsingDeclarationsoption is a boolean (default:false). Explicit resource management allows automatic teardown of disposables by callingSymbol.disposeorSymbol.asyncDisposemethod implicitly at the end of the variable’s scope. When this option is set totrue, this rule ignores variables declared withusingorawait using.\nExamples ofincorrectcode for the{ \"ignoreUsingDeclarations\": true }option:\nExamples ofcorrectcode for the{ \"ignoreUsingDeclarations\": true }option:\nThereportUsedIgnorePatternoption is a boolean (default:false).\nUsing this option will report variables that match any of the valid ignore\npattern options (varsIgnorePattern,argsIgnorePattern,caughtErrorsIgnorePattern, ordestructuredArrayIgnorePattern) if they have been used.\nExamples ofincorrectcode for the{ \"reportUsedIgnorePattern\": true }option:\nExamples ofcorrectcode for the{ \"reportUsedIgnorePattern\": true }option:",
    "config_examples": []
  }
}