{
  "name": "no-useless-rename",
  "meta": {
    "description": "Disallow renaming import, export, and destructured assignments to the same name",
    "url": "https://eslint.org/docs/latest/rules/no-useless-rename",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": false,
      "fixable": true,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Disallow renaming import, export, and destructured assignments to the same name\n🔧FixableSome problems reported by this rule are automatically fixable by the--fixcommand lineoption\nTable of ContentsRule DetailsOptionsWhen Not To Use ItCompatibilityRelated RulesVersionResources\nES2015 allows for the renaming of references in import and export statements as well as destructuring assignments. This gives programmers a concise syntax for performing these operations while renaming these references:\nimport{fooasbar}from\"baz\";export{fooasbar};let{foo:bar}=baz;123Copy code to clipboard\nWith this syntax, it is possible to rename a reference to the same name. This is a completely redundant operation, as this is the same as not renaming at all. For example, this:\nimport{fooasfoo}from\"bar\";export{fooasfoo};let{foo:foo}=bar;123Copy code to clipboard\nis the same as:\nimport{foo}from\"bar\";export{foo};let{foo}=bar;123Copy code to clipboard",
    "sub_configuration_introduction": "This rule allows for more fine-grained control with the following options:\nignoreImport: When set totrue, this rule does not check importsignoreExport: When set totrue, this rule does not check exportsignoreDestructuring: When set totrue, this rule does not check destructuring assignments\nBy default, all options are set tofalse:\nExamples ofincorrectcode for this rule by default:\nExamples ofcorrectcode for this rule by default:\nExamples ofcorrectcode for this rule with{ ignoreImport: true }:\nExamples ofcorrectcode for this rule with{ ignoreExport: true }:\nExamples ofcorrectcode for this rule with{ ignoreDestructuring: true }:",
    "config_examples": []
  }
}