{
  "name": "require-atomic-updates",
  "meta": {
    "description": "Disallow assignments that can lead to race conditions due to usage of await or yield",
    "url": "https://eslint.org/docs/latest/rules/require-atomic-updates",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Disallow assignments that can lead to race conditions due to usage ofawaitoryield\nTable of ContentsRule DetailsVariablesPropertiesOptionsallowPropertiesWhen Not To Use ItVersionResources\nWhen writing asynchronous code, it is possible to create subtle race condition bugs. Consider the following example:\nlettotalLength=0;asyncfunctionaddLengthOfSinglePage(pageNum){totalLength+=awaitgetPageLength(pageNum);}Promise.all([addLengthOfSinglePage(1),addLengthOfSinglePage(2)]).then(()=>{console.log('The combined length of both pages is',totalLength);});123456789Copy code to clipboard\nThis code looks like it will sum the results of callinggetPageLength(1)andgetPageLength(2), but in reality the final value oftotalLengthwill only be the length of one of the two pages. The bug is in the statementtotalLength += await getPageLength(pageNum);. This statement first reads an initial value oftotalLength, then callsgetPageLength(pageNum)and waits for that Promise to fulfill. Finally, it sets the value oftotalLengthto the sum ofawait getPageLength(pageNum)and theinitialvalue oftotalLength. If thetotalLengthvariable is updated in a separate function call during the time that thegetPageLength(pageNum)Promise is pending, that update will be lost because the new value is overwritten without being read.\nOne way to fix this issue would be to ensure thattotalLengthis read at the same time as it’s updated, like this:\nasyncfunctionaddLengthOfSinglePage(pageNum){constlengthOfThisPage=awaitgetPageLength(pageNum);totalLength+=lengthOfThisPage;}12345Copy code to clipboard\nAnother solution would be to avoid using a mutable variable reference at all:\nPromise.all([getPageLength(1),getPageLength(2)]).then(pageLengths=>{consttotalLength=pageLengths.reduce((accumulator,length)=>accumulator+length,0);console.log('The combined length of both pages is',totalLength);});12345Copy code to clipboard",
    "sub_configuration_introduction": "This rule has an object option:\n\"allowProperties\": When set totrue, the rule does not report assignments to properties. Default isfalse.\nExample ofcorrectcode for this rule with the{ \"allowProperties\": true }option:",
    "config_examples": []
  }
}