{
  "name": "sort-keys",
  "meta": {
    "description": "Require object keys to be sorted",
    "url": "https://eslint.org/docs/latest/rules/sort-keys",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": true
    },
    "capabilities": {
      "recommended": false,
      "fixable": false,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Require object keys to be sorted\n❄️FrozenThis rule is currentlyfrozenand is not accepting feature requests.\nTable of ContentsRule DetailsOptionsdesccaseSensitivenaturalminKeysallowLineSeparatedGroupsignoreComputedKeysWhen Not To Use ItCompatibilityRelated RulesVersionResources\nWhen declaring multiple properties, some developers prefer to sort property names alphabetically to more easily find and/or diff necessary properties at a later time. Others feel that it adds complexity and becomes burden to maintain.",
    "sub_configuration_introduction": "The 1st option is\"asc\"or\"desc\".\n\"asc\"(default) - enforce properties to be in ascending order.\"desc\"- enforce properties to be in descending order.\nThe 2nd option is an object which has the following properties.\ncaseSensitive- iftrue, enforce properties to be in case-sensitive order. Default istrue.minKeys- Specifies the minimum number of keys that an object should have in order for the object’s unsorted keys to produce an error. Default is2, which means by default all objects with unsorted keys will result in lint errors.natural- iftrue, enforce properties to be in natural order. Default isfalse. Natural Order compares strings containing combination of letters and numbers in the way a human being would sort. It basically sorts numerically, instead of sorting alphabetically. So the number 10 comes after the number 3 in Natural Sorting.allowLineSeparatedGroups- iftrue, the rule allows to group object keys through line breaks. In other words, a blank line after a property will reset the sorting of keys. Default isfalse.ignoreComputedKeys- iftrue, the rule ignores all computed keys and doesn’t report unsorted properties separated by them. A computed key will reset the sorting of the following non-computed keys. Default isfalse.\nExample for a list:\nWithnaturalastrue, the ordering would be\n1\n3\n6\n8\n10\nWithnaturalasfalse, the ordering would be\n1\n10\n3\n6\n8\nExamples ofincorrectcode for the\"desc\"option:\nExamples ofcorrectcode for the\"desc\"option:\nExamples ofincorrectcode for the{caseSensitive: false}option:\nExamples ofcorrectcode for the{caseSensitive: false}option:\nExamples ofincorrectcode for the{natural: true}option:\nExamples ofcorrectcode for the{natural: true}option:\nExamples ofincorrectcode for the{minKeys: 4}option:\nExamples ofcorrectcode for the{minKeys: 4}option:\nExamples ofincorrectcode for the{allowLineSeparatedGroups: true}option:\nExamples ofcorrectcode for the{allowLineSeparatedGroups: true}option:\nExamples ofcorrectcode for the{ignoreComputedKeys: true}option:",
    "config_examples": []
  }
}