{
  "name": "strict",
  "meta": {
    "description": "Require or disallow strict mode directives",
    "url": "https://eslint.org/docs/latest/rules/strict",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": false,
      "fixable": true,
      "has_suggestions": false
    }
  },
  "content": {
    "introduction": "Require or disallow strict mode directives\n🔧FixableSome problems reported by this rule are automatically fixable by the--fixcommand lineoption\nTable of ContentsRule DetailsOptionssafeglobalfunctionneverearlier default (removed)When Not To Use ItVersionResources\nA strict mode directive is a\"use strict\"literal at the beginning of a script or function body. It enables strict mode semantics.\nWhen a directive occurs in global scope, strict mode applies to the entire script:\n\"use strict\";// strict modefunctionfoo(){// strict mode}1234567Copy code to clipboard\nWhen a directive occurs at the beginning of a function body, strict mode applies only to that function, including all contained functions:\nfunctionfoo(){\"use strict\";// strict mode}functionfoo2(){// not strict mode};(function(){\"use strict\";functionbar(){// strict mode}}());123456789101112131415Copy code to clipboard\nIn theCommonJSmodule system, a hidden function wraps each module and limits the scope of a “global” strict mode directive.\nInECMAScriptmodules, which always have strict mode semantics, the directives are unnecessary.",
    "sub_configuration_introduction": "This rule has a string option:\n\"safe\"(default) corresponds either of the following options:\"global\"if ESLint considers a file to be aCommonJSmodule\"function\"otherwise\"global\"requires one strict mode directive in the global scope (and disallows any other strict mode directives)\"function\"requires one strict mode directive in each top-level function declaration or expression (and disallows any other strict mode directives)\"never\"disallows strict mode directives\nThe\"safe\"option corresponds to the\"global\"option if ESLint considers a file to be aNode.jsorCommonJSmodule because the configuration specifies either of the following:\n\"sourceType\": \"commonjs\"inlanguage options\"globalReturn\": trueproperty in theecmaFeaturesobject ofparser options\nOtherwise the\"safe\"option corresponds to the\"function\"option.\nExamples ofincorrectcode for this rule with the\"global\"option:\nExamples ofcorrectcode for this rule with the\"global\"option:\nThis option ensures that all function bodies are strict mode code, while global code is not. Particularly if a build step concatenates multiple scripts, a strict mode directive in global code of one script could unintentionally enable strict mode in another script that was not intended to be strict code.\nExamples ofincorrectcode for this rule with the\"function\"option:\nExamples ofcorrectcode for this rule with the\"function\"option:\nExamples ofincorrectcode for this rule with the\"never\"option:\nExamples ofcorrectcode for this rule with the\"never\"option:\n(removed) The default option (that is, no string option specified) for this rule wasremovedin ESLint v1.0. The\"function\"option is most similar to the removed option.\nThis option ensures that all functions are executed in strict mode. A strict mode directive must be present in global code or in every top-level function declaration or expression. It does not concern itself with unnecessary strict mode directives in nested functions that are already strict, nor with multiple strict mode directives at the same level.\nExamples ofincorrectcode for this rule with the earlier default option which has been removed:\nExamples ofcorrectcode for this rule with the earlier default option which has been removed:",
    "config_examples": []
  }
}