{
  "name": "use-isnan",
  "meta": {
    "description": "Require calls to isNaN() when checking for NaN",
    "url": "https://eslint.org/docs/latest/rules/use-isnan",
    "type": "",
    "status": {
      "deprecated": false,
      "removed": false,
      "frozen": false
    },
    "capabilities": {
      "recommended": true,
      "fixable": false,
      "has_suggestions": true
    }
  },
  "content": {
    "introduction": "Require calls toisNaN()when checking forNaN\n✅RecommendedUsing therecommendedconfig from@eslint/jsin aconfiguration fileenables this rule💡hasSuggestionsSome problems reported by this rule are manually fixable by editorsuggestions\nTable of ContentsRule DetailsOptionsenforceForSwitchCaseenforceForIndexOfKnown LimitationsVersionResources\nIn JavaScript,NaNis a special value of theNumbertype. It’s used to represent any of the “not-a-number” values represented by the double-precision 64-bit format as specified by the IEEE Standard for Binary Floating-Point Arithmetic.\nBecauseNaNis unique in JavaScript by not being equal to anything, including itself, the results of comparisons toNaNare confusing:\nNaN === NaNorNaN == NaNevaluate tofalseNaN !== NaNorNaN != NaNevaluate totrue\nTherefore, useNumber.isNaN()or globalisNaN()functions to test whether a value isNaN.",
    "sub_configuration_introduction": "This rule has an object option, with two options:\n\"enforceForSwitchCase\": true(default) additionally disallowscase NaNandswitch(NaN)inswitchstatements.\"enforceForIndexOf\": trueadditionally disallows the use ofindexOfandlastIndexOfmethods withNaN. Default isfalse, meaning that this rule by default does not warn aboutindexOf(NaN)orlastIndexOf(NaN)method calls.\nTheswitchstatement internally uses the===comparison to match the expression’s value to a case clause.\nTherefore, it can never matchcase NaN. Also,switch(NaN)can never match a case clause.\nExamples ofincorrectcode for this rule with\"enforceForSwitchCase\"option set totrue(default):\nExamples ofcorrectcode for this rule with\"enforceForSwitchCase\"option set totrue(default):\nExamples ofcorrectcode for this rule with\"enforceForSwitchCase\"option set tofalse:\nThe following methods internally use the===comparison to match the given value with an array element:\nArray.prototype.indexOfArray.prototype.lastIndexOf\nTherefore, for any arrayfoo,foo.indexOf(NaN)andfoo.lastIndexOf(NaN)will always return-1.\nSet\"enforceForIndexOf\"totrueif you want this rule to reportindexOf(NaN)andlastIndexOf(NaN)method calls.\nExamples ofincorrectcode for this rule with\"enforceForIndexOf\"option set totrue:\nExamples ofcorrectcode for this rule with\"enforceForIndexOf\"option set totrue:\nThis option checks methods with the given names,even ifthe object which has the method isnotan array.",
    "config_examples": []
  }
}