{
    "noImportCycles": {
        "description": "Description\n\nPrevent import cycles.\nThis rule warns when a file imports another file that, either directly\nor indirectly, imports the original file again.\nCycles can lead to symbols that are unexpectedlyundefinedand are\ngenerally considered poor code hygiene.\nIf a cycle is detected, it is advised to move code such that imports\nonly go in a single direction, i.e. they don’t point “back” to the\nimporting file.\nHowever, files that import themselves are allowed, and the rule won’t trigger for these use cases.\nThis allows for encapsulation of functions/variables into a namespace instead of using a\nstatic class (triggersnoStaticOnlyClass).\nNoteThis rule is computationally expensive. If you are particularly\npressed for lint time, or don’t think you have an issue with dependency\ncycles, you may not want this rule enabled.",
        "option": "The rule provides the options described below.\nignoreTypesSection titled “ignoreTypes”\nIgnores type-only imports when finding an import cycle. A type-only import (import type)\nwill be removed by the compiler, so it cuts an import cycle at runtime. Note that named type\nimports (import { type Foo }) aren’t considered as type-only because it’s not removed by\nthe compiler if theverbatimModuleSyntaxoption is enabled. Enabled by default.\n{  \"linter\": {    \"rules\": {      \"nursery\": {        \"noImportCycles\": {          \"options\": {            \"ignoreTypes\": false          }        }      }    }  }}\nInvalidSection titled “Invalid”\ntypes.ts\n1import type { bar } from \"./qux.ts\";2\n3export type Foo = {4  bar: typeof bar;};\nqux.ts\n1import type { Foo } from \"./types.ts\";2\n3export function bar(foo: Foo) {4    console.log(foo);}\n/qux.ts:1:26lint/nursery/noImportCycles━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━⚠This import is part of a cycle.>1 │import type { Foo } from ”./types.ts”;│^^^^^^^^^^^^2 │3 │export function bar(foo: Foo) {ℹThis import resolves to/types.ts… which imports/qux.ts… which is the file we’re importing from.ℹThis rule belongs to the nursery group, which means it is not yet stable and may change in the future. Visithttps://biomejs.dev/linter/#nurseryfor more information."
    }
}