{
    "useFilenamingConvention": {
        "description": "Description\n\nEnforce naming conventions for JavaScript and TypeScript filenames.\nEnforcingnaming conventionshelps to keep the codebase consistent.\nA filename consists of two parts: a name and a set of consecutive extensions.\nFor instance,my-filename.test.jshasmy-filenameas name, and two consecutive extensions:.testand.js.\nBy default, the rule ensures that the name is either incamelCase,kebab-case,snake_case,\nor equal to the name of one export in the file.\nBy default, the rule ensures that the extensions are either incamelCase,kebab-case, orsnake_case.\nThe rule supports the following exceptions:\nThe name of the file can start with a dot, a plus sign, or a dollar sign, be prefixed and suffixed by underscores _.\nFor example, .filename.js, +filename.js, $filename.js, __filename__.js, or even .__filename__.js.\n\nThe convention of prefixing a filename with a plus sign is used by Sveltekit and Vike.\nThe convention of prefixing a filename with a dollar sign is used by TanStack Start for file-based routing.\nThe convention of prefixing a filename with a plus sign is used by Sveltekit and Vike.\nThe convention of prefixing a filename with a dollar sign is used by TanStack Start for file-based routing.\nAlso, the rule supports dynamic route syntaxes of Next.js, SolidStart, Nuxt, and Astro.\nFor example [...slug].js and [[...slug]].js are valid filenames.\nNote that if you specify thematchoption, the previous exceptions will no longer be handled.",
        "option": "The rule provides several options that are detailed in the following subsections.\n{  \"linter\": {    \"rules\": {      \"style\": {        \"useFilenamingConvention\": {          \"options\": {            \"strictCase\": false,            \"requireAscii\": true,            \"match\": \"%?(.+?)[.](.+)\", // Since v2.0.            \"filenameCases\": [              \"camelCase\",              \"export\"            ]          }        }      }    }  }}\nstrictCaseSection titled “strictCase”\nWhen this option is set totrue, it forbids consecutive uppercase characters incamelCaseandPascalCase.\nFor instance,  when the option is set totrue,agentIDwill throw an error.\nThis name should be renamed toagentId.\nWhen the option is set tofalse, consecutive uppercase characters are allowed.agentIDis so valid.\nDefault:true\nrequireAsciiSection titled “requireAscii”\nWhen this option is set totrue, it forbids names that include non-ASCII characters.\nFor instance,  when the option is set totrue,caféor안녕하세요will throw an error.\nWhen the option is set tofalse, a name may include non-ASCII characters.caféand안녕하세요are so valid.\nDefault:true\nmatchSection titled “match”\nmatchdefines a regular expression that the filename must match.\nIf the regex has capturing groups, then the first capture is considered as the filename\nand the second one as file extensions separated by dots.\nFor example, given the regular expression%?(.+?)\\.(.+)and the filename%index.d.ts,\nthe filename matches the regular expression with two captures:indexandd.ts.\nThe captures are checked againstfilenameCases.\nNote that we use the non-greedy quantifier+?to stop capturing as soon as we met the next character (.).\nIf we use the greedy quantifier+instead, then the captures could beindex.dandts.\nThe regular expression supports the following syntaxes:\nGreedy quantifiers *, ?, +, {n}, {n,m}, {n,}, {m}\nNon-greedy quantifiers *?, ??, +?, {n}?, {n,m}?, {n,}?, {m}?\nAny character matcher .\nCharacter classes [a-z], [xyz], [^a-z]\nAlternations |\nCapturing groups ()\nNon-capturing groups (?:)\nCase-insensitive groups (?i:) and case-sensitive groups (?-i:)\nA limited set of escaped characters including all special characters\nand regular string escape characters \\f, \\n, \\r, \\t, \\v.\nNote that you can also escape special characters using character classes.\nFor example, \\$ and [$] are two valid patterns that escape $.\nfilenameCasesSection titled “filenameCases”\nBy default, the rule enforces that the filename  is either incamelCase,kebab-case,snake_case, or equal to the name of one export in the file.\nYou can enforce a stricter convention by settingfilenameCasesoption.filenameCasesaccepts an array of cases among the following cases:camelCase,kebab-case,PascalCase,snake_case, andexport.\nThis option also applies to the file extensions.\nExtensions in lowercase are always allowed regardless of howfilenameCasesis set."
    }
}